[
    {
        "resumo": "Este artigo descreve o desenvolvimento de um banco de dados, deum software de carregamento de dados e de um sistema de consulta a dados,com a finalidade de centralizar as informações solares e eólicas obtidas porsensores pertencentes a uma subestação do projeto SONDA, instalada noObservatório Espacial do Sul em São Martinho da Serra no Rio Grande doSul."
    },
    {
        "abstract": "Managing a mobile ad hoc network (MANET) is a complex taskgiven the mobility of nodes and resource limitation of the devices. Onestrategy for simplifying the development of applications in this context is byproviding group management services to abstract the network topology andassist the distributed data management. This paper proposes a groupmanagement service based on the “Friend of a Friend” (FOAF) ontology.We implemented an NS-2 agent based on the proposed model and simulatethe system in a urban scenario in which vehicle drivers exchange informationabout the traffic. We considered two metrics for validating the system: energyconsumption and traffic load.",
        "resumo": "O gerenciamento de redes ad hoc sem fio (MANETs) é uma tarefacomplexa devido à mobilidade dos nós e à limitação dos recursos dosdispositivos envolvidos. Uma estratégia para simplificar o desenvolvimento deaplicações neste contexto é fazer uso de serviços de gerenciamento de grupospara abstrair a topologia da rede e auxiliar o gerenciamento de dadosdistribuídos. Neste trabalho é proposto um modelo de grupo para MANETsbaseado na ontologia “Friend of a Friend” (FOAF). Para sua análise foiimplementado um agente no NS-2 e simulados alguns cenários em umcontexto de troca de informações entre motoristas de uma cidade. As métricasconsideradas foram o consumo de energia e troca de pacotes."
    },
    {
        "abstract": "Development of information systems usually implies in codificationof basic and repetitive activities that manipulate the data of the tables in thedatabase. This paper presents a tool that automates these steps, thuscontributing to increased productivity in the software development process.",
        "resumo": "Construção de sistema de informação normalmente se dá pelarealização de atividades básicas e repetitivas de cadastros das tabelas dobanco de dados. Este trabalho apresenta uma ferramenta que automatizaesses passos, contribuindo assim para o aumento da produtividade noprocesso de desenvolvimento de software."
    },
    {
        "abstract": "A Relational Database is represented by a collection of tables, whereeach tuple represents a relation between a set of values. To submit queries inrelational databases it can be used Relational Algebra. Because it is a formallanguage, few tools interpret queries in relational algebra format, making stu-dents learning harder. This work proposes a relational algebra query simulatorsoftware to support relational algebra operations learning. We analyzed existentsoftware needs and implemented a tool based on these requirements.",
        "resumo": "Um Banco de Dados Relacional é representado por uma coleção detabelas, onde cada linha representa uma relação entre um conjunto de valo-res. Para efetuar consultas em bancos de dados relacionais, pode-se utilizar aÁlgebra Relacional. Por se tratar de uma linguagem formal, poucas ferramen-tas interpretam consultas em álgebra relacional, dificultando a aprendizagemdos alunos. O presente trabalho propõe um programa simulador de consultasem álgebra relacional para auxiliar na aprendizagem das operações fundamen-tais. Foram exploradas as carências dos software existentes e implementadauma ferramenta com base nessas deficiências."
    },
    {
        "abstract": "This article describes the initial process of developing the querymodule of a WebSIG application for disclosure information of anEnvironmental Information System. The prototype developed allows thedisplay of the environmental monitoring points installed in Taquari-AntasWatershed through the web and in a georeferenced way.",
        "resumo": "Este artigo descreve o processo inicial de desenvolvimento domódulo de consultas de uma aplicação WebSIG para divulgação deinformações de um Sistema de Informação Ambiental. O protótipo WebSIGdesenvolvido permite a exibição dos pontos de monitoramento ambientalinstalados na Bacia Hidrográfica Taquari-Antas através da web e de formageorreferenciada."
    },
    {
        "resumo": "Um arquivo de log armazena mensagens sobre os eventos produzidospor sistemas computacionais. Esse armazenamento permite fazer um rastrea-mento dos eventos produzidos pelos sistemas. Geralmente, os arquivos de logsão volumosos devido ao grande número de eventos que podem ocorrer nossistemas. Este trabalho propõe uma ferramenta para monitorar a geração delog. Essa ferramenta, intitulada RealLog, poderá ser configurada através demétodos que colaboram na análise de arquivos de logs. O RealLog estará inte-grado a um sistema gerenciador de banco de dados com caracterı́sticas especi-ais para tratar fluxo contı́nuos de dados."
    },
    {
        "resumo": "Este artigo descreve o desenvolvimento da interface gráfica com ousuário para um sistema de integração de esquemas XML denominado BInXS.Este sistema tem como peculiaridade a abstração conceitual de esquemasXML e a resolução de conflitos de integração inerentes à representação dedados XML em nível conceitual, visando a geração de um esquema conceitualglobal. O processo de integração é semi-automático, exigindo a intervençãode um usuário especialista em diversas tarefas. Assim sendo, uma interfacecom usuário bem projetada se faz necessária para viabilizar o processo. Oprojeto da interface está concluído e a implementação está em finalização."
    },
    {
        "abstract": "This paper presents initials results about experiments that analyze theperformance of the PostgreSQL DBMS. The experiments has been conductedover two different installations: the standard one and an installation using tu-ning techniques. Operations such as UPDATE, INSERT, DELETE and SELECThave been executed in order to simulate their use in both environments.",
        "resumo": "Este artigo apresenta resultados iniciais de um experimento realizadosobre o SGBD Postgresql. Os experimentos foram realizados em dois ambien-tes: instalação padrão do SGBD e outra usando técnicas de tuning. Foramrealizadas operações de inserção, alteração, deleção e seleção a fim de simularseu comportamento, em termos de performance, nos dois ambientes instalados."
    },
    {
        "abstract": "The web can be considered a huge repository of temporal informa-tion, once daily receives a huge amount of new pages. Generally, users areinterested in information related to a specific temporal period. Considering theinformation retrieval area, researches have preliminarily incorporated the tem-poral dimension to the search engines. This paper presents a study that descri-bes the evolution of search engines on the exploitation of temporal information.Research directions and future perspectives are also presented, considering theauthors’ point of view.",
        "resumo": "A Web recebe todos os dias um turbilhão de páginas. Com isso, elaacaba se tornando um repositório de informações temporais. Diante dessa fontede informação, os usuários podem estar interessados em informações de um pe-ríodo de tempo específico. Ao perceber o valor do tempo para a recuperaçãode informação, os pesquisadores começaram a incorporar a dimensão tempo-ral aos motores de busca. Este trabalho apresenta a evolução dos motores debusca com relação à exploração da informação temporal, bem como aponta asdireções de pesquisa e perspectivas futuras, sob o ponto de vista dos autores."
    },
    {
        "abstract": "XML is a standard format for representation and exchange of data,specially on the Web. Given its semistructured and flexible nature fororganizing the same data, XML allows the definition of several heterogeneousschemata for different data sources in a same domain. Such a situation makescomplex the definition of a single query over these data sources. The BInXSsystem is a solution to this problem, generating a global conceptual schemabased on a set of local XML schemata in a same domain. This paper presentsa system module that manages mappings between components of theconceptual schema to each local XML schema, allowing the easy translationof global queries. This module is a contribution to BInXS development.",
        "resumo": "XML é um formato popular para a representação e intercâmbio dedados, principalmente na Web. Dada a sua natureza semi-estruturada eflexível para organizar um mesmo dado, XML permite a definição de váriosesquemas de dados para diferentes fontes de dados em um mesmo domínio.Esta situação torna complexa a formulação de uma única consulta sobre estasfontes de dados. O sistema BInXS é uma solução para este problema, gerandoum esquema conceitual global a partir de um conjunto de esquemas XMLlocais em um mesmo domínio. Este artigo apresenta um módulo para agerência dos mapeamentos de componentes do esquema conceitual para cadaesquema XML local, facilitando a tradução de uma consulta em nível global.Este módulo é uma contribuição para o desenvolvimento do BInXS."
    },
    {
        "resumo": "Sistemas de busca na Web são voltados ao suporte de consultas porpalavras-chave que permitem pouca expressividade do usuário. Este artigoapresenta um novo modelo de ferramenta de busca, que utiliza algunsprincípios de consultas a dados estruturados para indexar documentos Web einterpretar consultas do usuário."
    },
    {
        "abstract": "This article aims to evaluate technologies to ensure highavailability to server database, through comparison of features available intwo database management systems, Oracle and SQL Server. The study wasconducted by the acquisition of features available to both DBMS, create acomparative table contents the research results and their analysis. Wasobserved that the Oracle presents major high availability than SQL Server,however, SQL Server showed higher robustness in the points of failureanalysis as well as to attend demands of disaster recovery.",
        "resumo": "Este artigo objetiva avaliar as tecnologias para garantir altadisponibilidade para servidores de banco de dados, por meio da comparaçãode características disponíveis em dois sistemas gerenciadores de banco dedados, Oracle e SQL Server. O estudo foi conduzido pela aquisição dascaracterísticas disponíveis em ambos os SGBD's, elaboração de um quadrocomparativo contendo os resultados da pesquisa e respectivas análises.Observou-se que o gerenciador Oracle apresenta mais recursos de altadisponibilidade que o SQL Server, no entanto, este outro apresentou maiorrobustez na análise de pontos de falha e recursos para atender demandas derecuperação em caso de desastre."
    },
    {
        "abstract": "This paper presents a proposal for using tools to aid decisionmaking in public health. The proposal is to implement the process ofKnowledge Discovery in Databases on the DATASUS database and tointegrate the gathered results into a Geographic Information System. Thisproposal focuses mainly on the distribution of knowledge acquired through theprocess of Knowledge Discovery in Databases in space and time seeking tounderstand the events and patterns of health, on a regional and temporalizedbasis.",
        "resumo": "O presente artigo apresenta uma proposta de uso de ferramentas deauxílio à tomada de decisão na saúde pública. A proposta baseia-se naaplicação do processo de Descoberta de Conhecimento em Bases de Dadossobre as bases de dados do DATASUS, e a posterior integração dasinformações e conhecimentos obtidos a um Sistema de InformaçõesGeográficas. Tal proposta tem como foco principal a distribuição doconhecimento adquirido através do processo de Descoberta de Conhecimentoem Bases de Dados no espaço e no tempo buscando o entendimento doseventos e padrões de saúde, de forma regionalizada e temporalizada."
    },
    {
        "resumo": "As redes de colaboração científica têm despertado o interesse da comunidadecientifica mundial. Elas conseguem representar problemas de maneira objetiva, oportunizandoum estudo dos diversos tipos de relacionamentos entre grupos, entidades e pessoas. No campoda ciência da computação as redes de colaboração científica vêm sendo utilizadas paraanalisar e identificar as tendências sobre as publicações de um pesquisador, quantidade depublicações ou pessoas vinculadas a pesquisadores. Este trabalho apresenta uma ferramentaque possibilita a análise quantitativa da produção cientifica de pesquisadores. Essa análise éproveniente das informações disponibilizadas pela DBLP, através de um documento XML."
    },
    {
        "abstract": "Cloud computing has emerged as a new paradigm in thedeployment of applications in which computing resources are provided as aservice via a network connection. These services are provided in the form ofsoftware, infrastructure and platforms. With the use of these services areoffering users’ information, often confidential unknown geographicallyremote servers, or databases in the clouds. This paper presents overview ofthis type of database, as well as features and advantages, besides dealingwith the challenges encountered in managing the data stored in thisenvironment.",
        "resumo": "Computação em Nuvem surge como um novo paradigma naimplantação de aplicações em que os recursos computacionais sãofornecidos como um serviço através de uma conexão de rede. Esses serviçossão disponibilizados em forma de software, infraestruturas e plataformas.Com a utilização desses serviços usuários estão disponibilizandoinformações, muitas vezes confidenciais em servidores remotosdesconhecidos geograficamente, ou seja, os bancos de dados em nuvem. Esteartigo apresenta uma visão geral desse tipo de banco de dados, assim comocaracterísticas e vantagens, além de tratar dos desafios encontrados nogerenciamento dos dados armazenados nesse ambiente."
    },
    {
        "abstract": "Although it has already detected the need to support approximatequeries in a RDBMS, the current SQL standard didn’t define it yet. This pa-per describes additions to SQL standard needed for approximate queries (inclu-ding user-defined operators and session variables) and presents the PGSimila-rity tool that uses the described infrastructure and implements a set of similarityoperators. Furthermore, indexing support was developed for some similarityfunctions.",
        "resumo": "Embora já tenha sido detectada a necessidade de suporte a consul-tas aproximadas em um SGBDR, o atual padrão SQL não o definiu ainda. Opresente trabalho descreve o suporte SQL necessário as consultas aproximadas(incluindo operadores e variáveis de sessão definidas pelo usuário) e apresentauma ferramenta que utiliza a infra-estrutura definida e implementa um conjuntode operadores de similaridade. Além disso, suporte à indexação foi desenvol-vido para algumas funções de similaridade."
    }
]