[{"abstract": "This paper introduces an application for multimedia content sharing,focusing on the availability and management of the content between mobiledevices. The application, called GroupShare, groups the devices by the inte-rest in shared data, originating groups of interest. The content is shared in aP2P fashion, with a coordinator responsible for sharing content and its loca-tion. It also answers requests from clients and manages the location of replicas.GroupShare is developed in J2ME and communicates via Bluetooth channels.", "resumo": "Esse artigo propõe um aplicativo para o compartilhamento deconteúdo multimı́dia, focando na disponibilidade e na comunicação direta entredispositivos móveis. O aplicativo, chamado de GroupShare, agrupa os dispo-sitivos por interesse no conteúdo, formando grupos de interesse. O conteúdoé compartilhado em uma abordagem P2P, sendo que um coordenador gerenciao armazenamento e a localização do conteúdo compartilhado. GroupShare édesenvolvido em J2ME, e comunica-se por meio de canais Bluetooth."}, {"abstract": "XML is widely used for storing and exchanging information. However, thestructure understanding of XML instances may become hard due to the size and thenumber of tags that a document can present. Besides, there is a lack of tools thatenable viewing XML files in a graphical format. Therefore, the objective of this work isto implement a tool to generate e visualize the graphical representation of a XMLdocument in a graph format, facilitating the understanding of the document structureand its corresponding visualization.", "resumo": "A linguagem XML é muito utilizada para armazenamento e troca deinformações. Entretanto, o entendimento da estrutura de uma instância XML pode setornar difícil devido ao tamanho e ao número de tags que um documento podeapresentar. Além disso, existe uma carência de ferramentas que possibilitem avisualização de arquivos XML em um formato gráfico. Assim, o objetivo deste trabalhoé implementar uma ferramenta que possibilite a representação e visualização gráficade um documento XML em formato de grafo, facilitando o entendimento da estruturado documento e a sua correspondente visualização."}, {"abstract": "The climate changes affecting many areas of human life, of whichagriculture is heavily influenced. The occurrence of variations in climate maycause losses and damage in various agricultural sectors. Among thesevariations, El Niño, La Niña and Neutral years. Therefore, the prevision of thisis an important factor. Thus, this paper shows an analysis of data miningalgorithms in order to infer patterns and models that determine the occurrenceof El Niño, La Niña and Neutral years phenomena.", "resumo": "O clima interfere em várias áreas da vida humana, das quais aagricultura é fortemente influenciada. A ocorrência de variações climáticaspodem ocasionar perdas e danos em vários setores agrícolas. Dentre essasvariações, pode-se citar os fenômenos El Niño, La Niña e Anos Neutros.Portanto, a possibilidade de previsão desses fenômentos é um fatorimportante. Nesse sentido, esse trabalho mostra uma análise dos algoritmosde mineração de dados com o objetivo de inferir padrões e modelos quedeterminam a ocorrência dos fenômenos El Niño, La Niña e Anos Neutros."}, {"abstract": "This paper presents a proposal of generation and representation ofequivalences between concepts presents in XML documents, ontology andrelational model, within the scope of the framework X2Rel.This frameworkproposes the storage of XML documents belonging to a same domain but withdifferent structures, in a unified relational database, generated with theassistance of ontologies.", "resumo": "Este artigo apresenta uma proposta de geração e representação deequivalências entre conceitos presentes em documentos XML, ontologia emodelo relacional, dentro do âmbito do framework X2Rel.Tal frameworkpropõe o armazenamento de documentos XML, pertencentes a um mesmodomínio porém com diferentes estruturas, em uma base de dados relacionalunificada, gerada com o auxílio de ontologias."}, {"abstract": "This work presents an XML document versioning study. Based on thisstudy, we propose a tool, named XVersioning, for versioning XML schemas. Theaim of XML schema versioning is keep the XML document database valid inrelationship to updated XML schemas without changing the database. Roughlyspeaking, this is achieved storing all XML schema versions in the database.", "resumo": "Este artigo apresenta um estudo de abordagens para versionamentode documentos XML e, baseado neste estudo, a proposta de uma ferramentapara o versionamento de esquemas XML implementados na linguagem XMLSchema e a validação das instâncias desses esquemas. O objetivo doversionamento de esquemas XML é garantir que uma instância XML Danteriormente válida em relação a um esquema S não perca a validade apósatualizações em S ocorridas durante o seu ciclo de vida. Para tal, é necessáriorecuperar as várias versões de S existentes S0 , . . ., Sn . A validação, então, éfeita sobre uma dessas versões Si (0 ≤ i ≤ n) até que D seja ou não validado.Em muitas situações, o versionamento de esquemas evita perda de dados deinstâncias XML bem como a inoperância de aplicações baseadas em esquemaspara a troca de dados XML."}, {"abstract": "This paper presents a survey of Web form matching approaches inthe context of the Deep Web. First, it introduces the features used by eachauthor regarding matching processes. In the following, a comparison ofrelated work is provided. It concludes with an analysis of their contributionsand limitations, and suggests some topics for future research.", "resumo": "Este artigo apresenta uma revisão da literatura sobre matching deformulários Web no contexto da Deep Web. Primeiramente, abordam-se ascaracterísticas utilizadas por cada autor para a execução do matching. Nasequência, é apresentado um comparativo dos trabalhos relacionados. Oartigo conclui com uma análise das principais contribuições e limitações dasabordagens, além de sugerir alguns tópicos para pesquisas futuras."}, {"resumo": "Este artigo descreve uma ferramenta para análise de dados oriundosda construção naval que coleta os dados da Web, extrai informações dosdados coletados e as analisa em busca de inconsistências. Foi utilizado comoestudo de caso o Catálogo Navipeças, mantido pela Organização Nacional daIndústria do Petróleo. Os resultados mostram empresas com inconsistênciasnos relacionamentos de produção de bens e fornecimento de serviços."}, {"abstract": "Most data available currently in Web are just accessible by queries inWeb forms. These hidden data bases that are just revealed in response to those queriesare called Deep Web. One way to search contents in the Deep Web is to provide to theuser relevant Web forms to his/her interests (car dealers, airfare, etc) and the own usercan formulate his/her queries. This paper presents and evaluates strategies for clusters'persistence in a Web forms' similarity search system called WF-Sim with the purpose ofidentifying similar Web forms efficiently and effectively.", "resumo": "Grande parte dos dados disponíveis atualmente na Web só é acessívelatravés de consultas formuladas sobre Web forms. Estes bancos de dados“escondidos” e revelados apenas como resposta a estas consultas são denominados deDeep Web. Uma das formas de busca a conteúdos na Deep Web é fornecer ao usuárioWeb forms relevantes para os seus interesses (revendas de automóveis, passagensaéreas, etc) e o próprio usuário realiza suas buscas. Este trabalho apresenta e avaliaestratégias de persistência de clusters de afinidade em um mecanismo de casamento(matching) de Web forms por similaridade chamado WF-Sim, de forma que sejapossível identificar Web forms semelhantes entre si de forma eficiente e eficaz."}, {"resumo": "Este artigo apresenta os resultados iniciais de um experimentorealizado sobre o Apache Mahout com o objetivo de detectar similaridadeentre bases relacionais, utilizando Classificadores Bayesianos. Foramrealizados testes com os algoritmos disponíveis – Bayes e CBayes – paraclassificar os registros de duas bases de dados com conteúdo semelhante."}, {"abstract": "This paper describes a system that extracts the scientific production ofa set of researchers from their Lattes curriculums, analyzes the data searchingfor replicated references, and generates a graphical visualization of the colla-boration networks among the researchers. You can view the list of publicationsin common to any two researchers and evaluate the quality of replica identifi-cation. The analysis of the collaboration networks allows better understandinghow the interactions among researchers behave.", "resumo": "Este artigo descreve um sistema que extrai a produção científica deum conjunto de pesquisadores, a partir dos seus currículos Lattes, analisa osdados extraídos em busca de referências bibliográficas replicadas, e gera umavisualização gráfica das redes de colaboração entre os pesquisadores. É pos-sível visualizar a lista de publicações em comum a dois pesquisadores quais-quer e avaliar a qualidade da identificação de réplicas. A análise das redes decolaboração permite entender melhor como se comportam as interações entrepesquisadores."}, {"abstract": "The Web is the largest repository of data available, with over 150million high-quality tables. Several works have combined their efforts to allowqueries on them, but there are still challenges. One challenge, in particular,involves the various different types of structures found on the Web, limiting theamount of tables in the appropriate format for the application of operators usedin traditional databases. One of the fundamentally important operations for al-lowing data to be queried from different sources is the merge join. In this work,the merge join algorithm was adapted to two types of structures easily found onthe Web. We proposed three algorithms adaptions, all aimed at performance.According to the tests performed, one of them offers considerably higher perfor-mance than the others.", "resumo": "A Web é o maior repositório de dados disponı́vel, contando com maisde 150 milhões de tabelas no estilo relacional. Muitos trabalhos têm unidoesforços a fim de permitir consultas sobre elas, porém ainda existem desafios.Um deles diz respeito aos diversos tipos de estrutura encontrados na Web, li-mitando a quantidade de tabelas na formatação apropriada para aplicação dosoperadores utilizados em bancos de dados tradicionais. Uma das operaçõesde fundamental importância para permitir consulta dados de diferentes fontesé a junção merge. Neste trabalho, o algoritmo de junção merge foi adaptadopara dois tipos de estrutura facilmente encontrados na Web. São propostas trêsadaptações distintas, todas visando desempenho. De acordo com os testes re-alizados, uma delas apresenta desempenho consideravelmente maior do que asoutras."}, {"abstract": "Online Social Networks (OSN) have never been so popular as it isnowadays. Due to its fast growth, designing a suitable infrastructure demandstime and resources. Thus, a common approach adopted by several OSN is toset them on the Cloud. Although data gets spread throughout servers, a goodbalancing of data is barely achieved. To overcome this, several methods havebeen developed towards a good partitioning. This paper presents the main tech-niques for OSNs partitioning: general approaches, such as Full Replication andDistributed Hashing, and more specific methods for OSN such as Partitioningand Replication and Time-dependent Partitioning. Also, a comparative study ispresented highlighting which approaches are best for each possible context.", "resumo": "Redes Sociais Online (RSO) nunca foram tão populares quanto sãohoje. Devido ao seu rápido crescimento, especificar uma boa infraestruturademanda tempo e recursos. Por esse motivo é comum hospedá-las na nuvem.Mesmo com os dados distribuı́dos, um bom balanceamento dificilmente é con-templado. Assim, diversas técnicas tem sido desenvolvidas para alcançar umbom particionamento. Este artigo apresenta algumas técnicas para o particio-namento de RSO. Elas são classificadas como de uso geral, como Replicaçãototal e Hash distribuı́do, e métodos especı́ficos para RSO, como o SPAR e Par-ticionamento dependente de tempo. Ao final, um estudo comparativo é apresen-tando destacando quais abordagens são mais apropriadas para cada cenário."}, {"abstract": "Most of the existing data sources have some form of representationfor real-world objects classes, which can be represented in different ways. Thisarticle describes the proposal of a similarity technique that is suitable forsearching for representations of real-world objects classes. A search approachis presented, based on the class context and attributes similarity. The maingoal is to use any internal information from the document that can berepresentative to characterize the class itself and adjust the similarity function.", "resumo": "A grande maioria das fontes de dados existentes possui algumaforma de representação de classes de objetos do mundo real, que podem serrepresentadas de maneiras distintas. Este artigo descreve a proposta de umatécnica de similaridade adequada para buscas por representações de classesde objetos do mundo real. É apresentado o projeto de uma abordagem debusca, que além da similaridade de atributos também é baseada no contextoonde a classe está inserida. A idéia principal é a utilização de qualquerinformação interna ao documento que possa ser usada para caracterizar aclasse propriamente dita e ajustar a função de similaridade através deinformações do contexto."}]