[{"abstract": "Relational databases uses specific SQL extensions for their productfunctions, which makes the development of complex applications unfeasiblemainly because compatibility with more than one relational database would re-quire specific codes for each database. This paper describes the developmentof multi-database applications based on a methodology of creation of the ins-tallation artifacts for the database and a technique to develop multi-databasesources codes.", "resumo": "Os bancos de dados relacionais fornecem funcionalidades especı́ficasde produtos através de extensões da linguagem SQL, inviabilizando o desenvol-vimento de aplicações complexas e compatı́veis com mais de um banco de da-dos relacional sem que essas aplicações tenham código especı́fico para cada umdeles. Este artigo aborda o desenvolvimento de aplicações totalmente indepen-dentes de banco de dados através de uma metodologia de criação de artefatosde instalação da estrutura de dados e de uma técnica de desenvolvimento decódigo-fonte independentemente de produto."}, {"abstract": "Search engines do not support specific searches for web formsfound on Deep Web. Within this context, the WF-Sim project proposes aquery-by-similarity system for Web Forms to deal with this lack. This paperpresents an indexing technique for querying-by-similarity web forms as a WF-Sim system component. This technique is centered on suitable index structuresto the main kinds of queries applied to web forms, as well as someoptimizations in these structures to reduce the number of index entries. Toevaluate the indexes’ performance, we ran experiments on two persistencestrategies: file system and database. The performance of accessing thedatabase was higher. We also compare the performance of our indexes withthe traditional keyword-based index, and the results were also satisfactory.", "resumo": "Motores de busca atuais não possuem suporte à buscas específicaspor formulários web relacionados à Deep Web. Neste contexto, o projeto WF-Sim propõe um processador de consultas por similaridade para formuláriosWeb para lidar com esta limitação. Este artigo apresenta uma técnica deindexação para buscas por similaridade em formulários web, atuando comoum componente do sistema WF-Sim. Esta técnica está centrada em estruturasde índice adequadas aos principais tipos de consulta aplicados a formuláriosweb, bem como otimizações nestas estruturas para reduzir a quantidade deentradas no índice. Experimentos preliminares sobre duas estratégias depersistência de dados suportados pelo WF-Sim foram realizados: sistema dearquivos e banco de dados. O desempenho de acesso ao banco de dados foisuperior. Comparou-se também o desempenho dos índices propostos contra otradicional índice de palavras-chave, e o resultado também foi satisfatório."}, {"resumo": "Web mashups são aplicações web que integram conteúdo de diver-sas fontes de dados disponibilizadas por terceiros através de uma interface deserviço. Para permitir que elas possam ser construı́das por profissionais quenão possuem a habilidade de programação, existem diversas ferramentas quefacilitam a combinação de serviços existentes através de uma interface simplese intuitiva. Dentre estas ferramentas pode ser citado o Exhibit. Através de umaanálise das funcionalidades disponibilizadas por esta ferramenta, observou-seque ela possui capacidade limitada para a integração de dados sobrepostos.Ou seja, se a mesma informação é disponibilizada por mais de uma fonte, estaferramenta não fornece meios adequados para combinar os dados e resolverpossı́veis conflitos de valor. Motivado por esta deficiência, neste trabalho é pro-posto um novo módulo para a ferramenta Exhibit, chamado de Mashup Impor-ter, que permite criar mapeamentos de dados provenientes de diferentes fontesque indicam que eles se referem ao mesmo item de dado. Este módulo de fusãode dados pode ser combinado com as demais funcionalidades já existentes naferramenta para a criação de novos serviços web."}, {"abstract": "We live in an era in which access to the Internet becomesincreasingly common. Social networks such as Twitter microblog, haverecorded a significant increase of posted messages. Some of these messageshave the geographical coordinates of the location where they were issued.This paper proposes the analysis of these posts considering the spatio-temporal aspects in order to obtain knowledge about users of Twitter. For this,we propose changes in the Weka data mining toolkit to obtain better results ontwitter data analysis. Experiments were performed with real data obtaininggood results.", "resumo": "Estamos vivenciando uma era em que o acesso à internet torna-secada vez mais frequente. As redes sociais, como o microblog Twitter, temregistrado um aumento significativo de mensagens postadas. Parte destasmensagens possui as coordenadas geográficas do local de onde foramemitidas. Este artigo propõe a análise destas mensagens considerando osaspectos espaço-temporais de modo a obter conhecimento sobre os usuáriosdo Twitter. Para isto, propõe adaptações na ferramenta de data mining Wekade forma a obter melhores resultados. Experimentos foram realizados comdados reais, com bons resultados."}, {"abstract": "One of the needs of the Brazilian Army is the automated classificationof documents called Boletins Internos (BIs), which must be grouped in order toproduce summarized reports about the military. In this paper, we propose asolution based on the Naive Bayes classifier. To archive this goal, there is aneed to select the text sentences that are related to each military, so that onlythose sentences are used during the training. In this sense, we propose twosentence selection heuristics that choose text blocks that appear close to themilitary name. The experiments show the benefits of using the Bayes classifieralong with the proposed sentence selection techniques.", "resumo": "Uma das necessidades do Exército Brasileiro é a classificação auto-matizada de documentos chamados Boletins Internos (BI), que devem ser agru-pados a fim de gerar relatórios sumarizados a respeito de militares. Neste tra-balho, propõe-se uma solução baseada no classificador Bayesiano. Além disso,é necessário identificar as sentenças que são relativas a cada militar, de modoque apenas elas sejam usadas durante o treinamento do classificador. Nessesentido, o trabalho propõe duas heurı́sticas de seleção de sentenças que esco-lhem trechos de texto que apareçam próximas ao nome de cada militar. Osexperimentos mostram os benefı́cios do uso do classificador bayesiano aliadoàs técnicas propostas de seleção de sentenças."}, {"abstract": "This paper describes some aspects of the NoSQL databases, inparticular the columnar approach, presenting its main characteristics andadvantages in relation to the linear storage method, analyzing its architectureand concepts applied on this storage model. The main advantages of columnarmodels are in compression, materialization and it helps the analysis ofiteration blocks. This model is a tendency in different applications that requirehigh availability.", "resumo": "Este artigo discute alguns aspectos dos bancos de dados no modeloNoSQL, em específico na abordagem colunar, apresentando suas principaiscaracterísticas e vantagens em relação ao método de armazenamento emlinhas, analisando sua arquitetura e conceitos aplicados neste modelo dearmazenamento. As principais vantagens do modelo colunar estão nacompressão, na materialização, o que ajuda na análise de blocos de iteração.Este modelo é uma tendência em diferentes domínios de aplicação que exijamalta disponibilidade."}, {"abstract": "This article explores the process of Entity Ranking based on relati-onships, with Wikipedia as a data source. We propose a graph model to re-present the relationships between entities. The ranking is calculated based onthe number of relationships between entities and their popularity. Furthermore,a graph compression technique is employed which is particularly useful for thetype of structure used by Wikipedia. The effectiveness of the ranking is describedthrough the analysis of answers for popular entities queries.", "resumo": "Este artigo explora o processo de Entity Ranking baseado em rela-cionamentos, tendo a Wikipedia como fonte de dados. É proposto um modelode grafos para representar os relacionamentos entre as entidades. O rankingé calculado com base no número de relacionamentos entre as entidades e napopularidade que elas possuem. Além disso, é empregada uma técnica de com-pressão de grafos que é particularmente útil para o tipo de estrutura utilizadapela Wikipedia. A efetividade do ranking é descrita através de análises dasrespostas obtidas para consultas a entidades populares."}, {"abstract": "The identification of person names inside natural language texts canbe used for many goals, such as applications related to the information retrievaland data analysis areas. Given this, our paper explores the entity extractionproblem by using unsupervised strategies focused on the recognition of personnames. The proposed approach employs a classification process divided in threestages, called Location, Filtering and Expansion. Each stage executes taggingrules that satisfies the purpose of the stage. The experiments show the perfor-mance of the rules for the classification of textual documents, analyzing the rulesindividually and collectively.", "resumo": "A identificação de nomes de pessoas em meio a textos em linguagemnatural pode ser usada para diversas finalidades, como por aplicações na áreade recuperação de informação e análise de dados. Dessa forma, esse artigoexplora a extração de entidades nomeadas por meio de estratégias não supervi-sionadas com foco no reconhecimento de nomes de pessoas. A abordagem pro-posta emprega um processo de classificação dividido em três etapas, chamadasde Localização, Filtragem e Expansão. Para cada uma dessas etapas são exe-cutadas regras de etiquetamento que atendem os requisitos de cada etapa. Osexperimentos demonstram o desempenho das regras utilizadas na classificaçãode documentos textuais, analisando-as de forma individual e coletiva."}, {"abstract": "Data extraction from HTML lists has the goal of transforming a re-cord list into a tabular format, composed by records and columns. This sort ofextraction serves many goals, such as feeding a dataspace that associates Webdata sources that refer to the same subject. There already exist proposals ofmechanisms that perform this extraction. One of them in particular divides theextraction process in three stages (Splitting, Alignment and Refinement), wherethe first one relies on a preexistent knowledge base. In this paper, we proposeextraction rules whose purpose is to replace the initial Splitting stage. Such ru-les explore the existence of content delimiters in the list records, and they arenot dependent on previous information. Experiments show the efficiency of theextraction rules applied over real HTML lists found on the Web, in comparisonwith the method currently used in the Splitting stage.", "resumo": "A extração de dados a partir de listas HTML tem por finalidade trans-formar uma lista de registros em um formato tabular composto por registros ecolunas. Essa extração serve a diversas finalidades, como alimentar um datas-pace que relaciona fontes de dados da Web que tratam de um assunto comum.Já existem mecanismos propostos que realizam essa extração. Um deles emparticular divide o processo de extração em três etapas(Splitting, Alignmente Refinement) sendo que a primeira delas depende de uma base de conheci-mento preexistente. Neste artigo são propostas regras de extração cujo objetivoé substituir a etapa inicial de Splitting. Tais regras exploram a existência efrequência de delimitadores de conteúdo nas linhas da lista, e independem deinformações prévias para funcionar. Os experimentos mostram a eficácia dasregras na extração aplicadas em listas HTML reais encontradas na Web, emcomparação com o método atualmente usado na etapa de Splitting."}, {"abstract": "This paper describes a data warehousing architecture targeted atthe problem of collecting and analyzing products offers available in the Web.Besides presenting the architecture, we describe the modules that were imple-mented in order to build an social network application that wraps the access tothe data warehouse. One of the implemented modules allows collecting data in-teractively, by gathering information provided by the users of the social networkthemselves. Another module that deserves attention uses the k-means classifierto automatically divide the users in communities based on their financial pro-file. Experiments show how the classifier behaves for dividing users in a fixednumber of communities given a controlled testing scenario.", "resumo": "Esse artigo descreve uma arquitetura de data warehouse voltada parao problema da coleta e análise de dados de ofertas de produtos disponibilizadosna Web. Além de apresentar a arquitetura, serão descritos os módulos queforam implementados tendo em vista a criação de uma aplicação de rede socialque encapsula o acesso ao data warehouse. Um dos módulos implementadospermite a coleta de dados de maneira interativa, a partir de dados de consumoinformados pelos usuários da rede social. Outro módulo que merece destaqueutiliza o algoritmo de classificação k-means para automaticamente dividir osusuários em comunidades com base no seu perfil de consumo. Os experimentosrelatam como o algoritmo se comporta na divisão dos usuários em um númerofixo de comunidades dado um cenário de teste controlado."}, {"resumo": "As bacias sedimentares marginais despertam grande interesse, tantode cientistas da terra, como da indústria petrolı́fera. Pesquisas nestas áreasgeram grandes volumes de dados provenientes de técnicas de geofı́sica eperfurações. Esses dados se encontram, muitas vezes, esparsos e armazena-dos de formas gráficas e esquemáticas, o que dificulta a aplicação de técnicascomputacionais para análise e descoberta de conhecimento. Além disso, nãohá informação suficiente para toda a área de interesse. Pensando nisso, criou-se uma ferramenta para coleta, distribuição e mapeamento destes dados. Comisso, criou-se novas oportunidades, pois com o auxı́lio de algoritmos de ma-peamento, novos dados foram estimados de modo a preencher uma área daqual anteriormente não havia informação geológica. Os algoritmos desen-volvidos compõem a ferramenta que serve para extração, transformação ecarga de dados (ETL). Estes dados compõem um banco de dados paleoge-ográficos de grande volume. Esse banco visa agregar informações existentescom informações estimadas para se obter novas informações via processos dedescoberta de conhecimento em banco de dados (Knowledge Discovery in Da-tabase, KDD)."}, {"abstract": "This paper proposes a Tool for relational databases modeling thatuses the Model-Driven Architecture (MDA) approach. The generic meta-modelused in this approach enables the designer to choose among differentlanguages and notations. Moreover, it allows the SQL automatic codegeneration. The tool for the Entity-Relationship notation will be constructedusing the Graphical Modeling Framework (GMF). A simple work in progressexample is presented the tool's main purpose.", "resumo": "ste artigo propõe uma ferramenta para modelagem de bancos dedados relacionais que usa a abordagem Model-Driven Architecture (MDA). Ometa-modelo utilizado na abordagem permite ao projetista escolher entrediferentes linguagens e notações. Além disso, permite a geração do código nalinguagem SQL de forma automática. A ferramenta para a notação Entidade-Relacionamento (ER) vai ser construída usando o Graphical ModelingFramework (GMF). Um simples exemplo do andamento do trabalho éapresentado para garantir a finalidade principal da ferramenta."}, {"resumo": "Este artigo apresenta a DBClassMapper, uma ferramenta de apoioao mapeamento e consultas ao ORM (Object-Relational Mapping) Gendalcujo principal diferencial é gerar consultas a partir das classes de objetos epoder comparar estas classes com as tabelas relacionais do banco de dados,facilitando a atualização dos mapeamentos. Esta ferramenta foi criada para aIDE Visual Studio 2010 da Microsoft, a qual utiliza o .Net como principalframework de desenvolvimento. A novidade da DBClassMapper é que odesenvolvedor pode gerar consultas complexas a partir de poucos cliques ecom muito pouco conhecimento de SQL."}, {"abstract": "This work describes an application based on GIS (GeographicInformation System), system used for the development of thematic map oftraffic accidents occurred during the year 2011 on the stretch of the highwayBR-101, located in the state of Espirito Santo (ES). This solution begins withthe extraction of accident data provided by DNIT and the inclusion of thesedata in a PostgreSQL database, then is performed the georeferencing of thehighway BR-101 in PostGIS, and ends with the creation of thematic mapthrough Quantum GIS.", "resumo": "Este trabalho descreve uma aplicação baseada em GIS (GeographicInformation System), sistema usado para o desenvolvimento de mapa temáticode acidentes de trânsito ocorridos no ano de 2011, no trecho da rodovia BR-101, localizado no Estado do Espírito Santo (ES). Esta solução começa com aextração de dados de acidentes fornecidos pelo DNIT e a inclusão destesdados em um banco de dados em PostgreSQL; a seguir é executado ogeorreferenciamento da rodovia BR-101 em PostGIS, e por fim cria-se o mapatemático através da Quantum GIS."}, {"resumo": "Versionamento é uma técnica muito usada para gerenciar mudançasem web services, visando minimizar o impacto em aplicações cliente. Esteartigo apresenta uma implementação eficiente de um repositório de versões deserviços usando OrientDB, um sistema de gestão de banco de dados orientadoa grafos."}, {"resumo": "Em um ambiente de desenvolvimento de sistemas de informação, osenvolvidos no processo, programadores, administradores de banco de dados,analistas de sistemas e outros, necessitam constantemente consultar o modelológico do banco de dados. Tal consulta geralmente dá-se através dosdiagramas de entidade relacionamento, estes representados na maioria dasvezes por meio da notação IE - Engenharia da Informação. Diante dessanecessidade pelos diagramas, o presente trabalho apresenta a ferramentaDBModeler, um sistema web para criação, manutenção e consulta dediagramas de bancos de dados. Com o uso desse sistema é possível manter umambiente compartilhado de acesso aos diferentes diagramas que podem serfacilmente criados e manipulados em uma interface amigável."}, {"abstract": "This paper describes an information retrieval tool that implementsthe vector space model and the Rocchio algorithm. Once a user has viewed theresult of a query, he or she can point out which of the returned items arerelevant. The system will optimize the query according to the user relevancefeedback.", "resumo": "Este artigo descreve uma ferramenta de recuperação de informaçõesque implementa o modelo espacial vetorial e o algoritmo Rocchio. Depois queum usuário tenha visualizado o resultado de uma consulta, ele pode apontarquais dos itens retornados são relevantes. O sistema otimizará a consulta deacordo com o feedback de relevância do usuário."}, {"abstract": "This paper present a text classification tool based on the NaïveBayes algorithm. We have described some basic concepts about textualclassification in the Information Retrieval area, the algorithm chosen, anexample of use and the architecture of our tool.", "resumo": "Este artigo apresenta uma ferramenta para classificação de textobaseada no algoritmo Naïve Bayes. São descritos alguns conceitos básicossobre classificação textual na área Recuperação de Informações, o algoritmoescolhido, um exemplo de utilização e a arquitetura da ferramenta."}]