[
    {
        "abstract": "Graph databases support applications based on complex data modelswhere the interconnectivity of data is an important aspect. The ever-increasingamount of data made available by these systems has been handled by graphdatabases in order to scale such systems. In spite of the straightforward wayto represent complex data, native graph databases provide efficient query pro-cessing by avoiding costly joins. This paper presents a comparative analysisamong native graph databases by considering some important features for datamanagement system in this context.",
        "resumo": "Sistemas de banco de dados em grafos suportam aplicações baseadasem modelos de dados cuja a interconectividade de dados é um aspecto impor-tante. O volume de dados crescente envolvendo tais aplicações vem sendo tra-tado por uma série de soluções de gerenciamento de dados baseados em grafosvisando a escalabilidade destes sistemas. Além de prover uma forma direta paraa representação de dados complexos, bancos de dados em grafos classificadoscomo nativos são capazes de executar consultas de forma eficiente por eliminaroperações custosas de junções. Este artigo apresenta uma análise compara-tiva entre alguns sistemas nativos atuais considerando algumas caracterı́sticasimportantes para sistemas de gerenciamento neste contexto."
    },
    {
        "abstract": "From traditional DBMS solutions involving the storage of documents,graphs and even key-value structures, models of databases are created with thepassage of time, and made the term NoSQL arise. However, doubts permeatethis scenario, for example, the performance of these new technologies with res-pect to relational databases. The main aim of this work is perform a compari-son between the database MongoDB document-oriented and relational databasePostgreSQL, based on the runtime of read and write operations. As a result werealized a big difference in performance between the tested data bases, especi-ally in search operations.",
        "resumo": "Dos SGBDs tradicionais à soluções envolvendo o armazenamento dedocumentos, grafos e até estruturas chave-valor, modelos de bancos de dadossão criados com o passar do tempo, e fizeram surgir o termo NoSQL. No en-tanto, algumas dúvidas permeiam este cenário, como, por exemplo, a perfor-mance de novas tecnologias em relação aos bancos de dados relacionais. Oprincipal objetivo deste trabalho é realizar uma comparação entre o banco dedados orientado a documentos MongoDB e o banco de dados relacional Post-greSQL, baseado no tempo de execução de operações de leitura e escrita. Comoresultado percebeu-se uma grande diferença de performance entre os bancostestados, principalmente nas operações de busca."
    },
    {
        "abstract": "Deploying business intelligence environments allow organizations tomake decisions that help their development. These environments areconstantly changing due to trends in the market, which makes traditionaltechnologies having difficulties in meeting the needs of business. This way, itwas developed a methodology that enables the implementation of suchenvironment in a quickly way, allowing to apply adjustments that comes fromthe market.",
        "resumo": "A implantação de ambientes de inteligência de negócio permitemque as organizações tomem decisões que auxiliem no seu desenvolvimento.Estes ambientes sofrem constantes mudanças devido as evoluções sofridaspelo mercado, o que faz com que tecnologias tradicionais tenham dificuldadesem atender as necessidades das empresas. Assim, foi desenvolvida umametodologia que propicia a implantação de tal ambiente de forma rápida,permitindo que adaptações oriundas do mercado sejam aplicadas."
    },
    {
        "abstract": "We propose in this paper an approach that simulates support fortransactions on a Hadoop-Hive environment through a HiveQL querymechanism of temporal series. Such proposal has as premise to get round thelimitation of Hadoop-Hive environment regarding UPDATE and DELETEoperations, given that data persisted on Hadoop Distributed File System(HDFS) can be provided by a relational database.",
        "resumo": "Propomos neste trabalho uma abordagem que simula o suporte atransações em um ambiente Hadoop-Hive através de um mecanismo deconsulta HiveQL de série temporal. Tal proposta tem como premissacontornar a limitação do ambiente Hadoop-Hive quanto às operações deUPDATE e DELETE, uma vez que os dados persistidos no HadoopDistributed File System (HDFS) podem ser providos por banco de dadosrelacional."
    },
    {
        "abstract": "The recent progress in movement analysis mostly considers spatio-temporal data (e.g. trajectories). However, other information (e.g., tags andcomments associated to the spatiotemporal data) could also help to better un-derstand movements (e.g., indentify classes of frequented places and events).This article introduces a method for semantic enriching textually annotated mo-vement data (e.g., trajectories, user’s trails in social media) by connecting themto Linked Data. The current version of our method uses spatial and textualsimilarity to find and rank possible connections. Real data from Flickr and Lin-kedGeoData have been used to test the method implementation.",
        "resumo": "O progresso recente na análise de movimento considera principal-mente dados espaço-temporais (e.g. trajetórias). Contudo, outras informações(e.g., tags e comentários associados a dados espaço-temporais) também pode-riam ajudar a explicar movimentos (e.g., identificar classes de locais e eventosfrequentados). Este artigo introduz um método para enriquecer semanticamentedados de movimento textualmente anotados (e.g., trajetórias, trilhas de usuáriosem mı́dias sociais) conectando-os a dados ligados. A versão atual do nossométodo usa similaridade espacial e textual para encontrar e ranquear possı́veisconexões. Dados reais do Flickr e LinkedGeoData foram utilizados para testara implementação do método."
    },
    {
        "abstract": "The web has been turning into a rich data source. Recent researchestry to create even more ways to use these data and/or to facilitate their access.There are a lot of tables in the Web that hold useful data for human consumption.They are characterized by the <table>tag. This paper details information retri-eval approaches related to Web tables, presenting a brief description of them, aswell as a comparison of their main features. Besides, some open issues in thisresearch area are highlighted.",
        "resumo": "A web tem se tornado uma rica fonte de dados. Pesquisas recentestentam criar cada vez mais meios de utilizar e/ou facilitar o acesso a essesdados. Existem muitas tabelas na Web que possuem dados úteis para o con-sumo humano. Elas são caracterizadas pela tag <table>. Este trabalho deta-lha abordagens de recuperação de informação relacionadas a tabelas na web,apresentando uma breve descrição delas e mostrando um comparativo entresuas principais caracterı́sticas. Além disso, são destacadas algumas questõesem aberto nessa área de pesquisa."
    },
    {
        "abstract": "XML (Extensible Markup Language) is a mark-up language that mo-dels semistructured data. XML lets the user define his own customized markuplanguage for different document classes. Users can create XML documents fre-ely. This flexibility has a drawback: processing XML documents can be com-putational onerous. In this context, schemas play an important role. This workpresents a survey of three XML schema extraction approaches. We use a runningexample to show how the approaches work.",
        "resumo": "Documentos XML são caracterizados por possuı́rem a estrutura ar-mazenada junto com os dados tornando a sua aplicação bastante flexı́vel.Porém, o efeito colateral dessa flexibilidade é que o processamento dos docu-mentos se torna custoso computacionalmente. Isso pode ser resolvido associ-ando um esquema ao documento permitindo que a aplicação conheça ‘a priori’a estrutura do documento a ser processado. Este trabalho tem como objetivoestudar algumas destas ferramentas apresentando as abordagens utilizadas porelas e uma breve comparação entre as mesmas."
    },
    {
        "abstract": "The increased use of mobile devices has led to a large increase in themoving objects trajectories generation. However, only the trajectories are oftennot sufficient to allow the movements semantic analysis. The increasing use ofmobile devices has also increased the remotely social media use, where users’posts can be viewed as sparse and annotated traces of their movement. Thispaper proposes a method for fusing trajectories with data from social media.The results are collections of trajectories annotated with texts inserted in socialmedia. The method is implemented and evaluated in experiments with real tra-jectories and postings of Twitter users, conducted in the same geographic regionwhere the trajectories occurred.",
        "resumo": "O aumento da utilização de dispositivos móveis tem ocasionado umgrande crescimento na geração de trajetórias de objetos móveis. Entretantosomente as trajetórias muitas vezes não são suficientes para permitir a análisesemântica dos movimentos. Junto ao crescimento da utilização de dispositi-vos móveis também aumentou a utilização de mídias sociais remotamente, ondepostagens dos usuários podem ser vistas como rastros esparsos e anotados deseu movimento. Este trabalho propõe um método para fusão de trajetórias comdados provenientes de mídias sociais. Os resultados são coleções de trajetó-rias anotadas com texto inserido em mídias sociais. O método é implementadoe avaliado em experimentos com trajetórias reais de postagens de usuários doTwitter, efetuadas na mesma região geográfica onde ocorreram as trajetórias."
    },
    {
        "abstract": "Several studies try to infer what happened with a moving object overa trajectory, but generally without using user’ reports or data relating toplanned tasks. This work proposes to analyze spatiotemporal inconsistenciesbetween trajectories of moving objects and planned or reported tasks usingthree data sources: the trajectories of moving objects (automatically collectedby GPS); User reports (spatiotemporal points that identify start and end oftask execution) and data planned tasks (duration and place of execution). Weare currently implementing the proposal and preparing experiments with realdata provided by a company specialized in services related to water supply.",
        "resumo": "Vários trabalhos tentam inferir o que ocorreu com um objeto móvelem uma trajetória, mas geralmente sem utilizar relatos do usuário ou dadosde tarefas planejadas. Este trabalho propõe analisar inconsistênciasespaçotemporais entre trajetórias de objetos móveis e tarefas planejadas ourelatadas, utilizando três fontes de dados: as trajetórias dos objetos móveis(coletada por GPS); Relatos dos usuários (pontos espaçotemporaisidentificam início e fim de execução da tarefa) e dados de tarefas planejadas(tempo de duração e local de execução). Atualmente, estamos implementado aproposta e preparando experimentos com dados reais fornecidos por umaempresa especializada em serviços relacionados com suprimento de água."
    },
    {
        "abstract": "Collecting geographic data by using satellites, global positioning sys-tem (GPS) and even crowdsourcing with free annotations often gathers data withlittle semantic, with ambiguities and little interoperability. This paper proposesa process to convert textual annotated geographic data to a linked geographicdata collection. This proposal is based in a process that filters and cleansdata, and then applys several techniques to align this data with existing linkeddata collection. Experiments applying the proposed process to Wikimapia andLinked Geo Data data generate linked data that support several useful SPARQLqueries.",
        "resumo": "A coleta de dados geográficos, utilizando tecnologias de sensoria-mento (e.g., GPS, câmeras) e mesmo sistemas de anotação colaborativa, fre-quentemente geram dados com semântica insuficiente, com ambiguidades epouca interoperabilidade. Este trabalho propõe um processo para converterdados geográficos anotados textualmente em dados ligados. A proposta baseia-se em um processo que filtra e limpa dados, e então aplica diversas técnicaspara alinhar estes dados a coleções existentes de dados ligados. A aplicação doprocesso proposto aos dados do Wikimapia e Linked Geo Data em experimentosgerou dados ligados que suportam diversas consultas SPARQL úteis."
    },
    {
        "abstract": "This paper describes an application based on GIS (GeographicInformation System), which describes the methodology for the creation ofthematic maps of violations of under age that occurred in the year 2012,located in the state of Espírito Santo. Thematic maps will be created aimingthe analysis with respect to time: for different times of day, days of the weekand months of the year. This solution uses the open source tool Quantum GIS.",
        "resumo": "Este trabalho descreve uma aplicação baseada em SIG (Sistema deInformação Geográfica), onde se descreve a metodologia de criação de mapastemáticos de infrações de menores ocorridos no ano de 2012, localizado noEstado do Espírito Santo. Os mapas temáticos serão criados visando a análisecom relação ao tempo: para os diversos períodos do dia, os dias da semana eos meses do ano. Esta solução usa a ferramenta livre Quantum GIS."
    },
    {
        "resumo": "Geralmente, a tarefa de modelar um Banco de Dados (BD) ficalimitada a uma representação que pode não ser fiel aos propósitos do BDcaso a notação da modelagem seja insuficiente ou carente de recursos quepermitam abstrair a realidade. O uso da abordagem Entidade-Relacionamento, por exemplo, para modelar Bancos de Dados Geográficos(BDG) pode causar perda de parte da semântica do BDG. Em função disso,foram propostos modelos específicos para BDG, como o modelo OMT-G(Object Modeling Technique for Geographic Applications). Este artigoapresenta uma ferramenta desenvolvida para a modelagem de BDG,denominada OMT-G Design."
    },
    {
        "resumo": "A plataforma UrbanMob visa disponibilizar um banco de dados(BD) de trajetórias urbanas de cidades brasileiras, sobre o qual podem seraplicadas técnicas de mineração de dados com a finalidade de gerarinformações para tomada de decisão na área de Gestão Urbana. Neste artigose apresenta parte desse projeto, que é o web service para o armazenamentodos dados. Para tanto, foram definidas três metas: criar os modelos dearquivos JSON para integração entre o web service e os dispositivos móveis;desenvolver um web service para receber os arquivos JSON e salvar asinformações no BD; criar um modelo de armazenamento de dados consistente."
    },
    {
        "abstract": "This paper proposes a geographic extension for a relational databasemodeling tool using the Model-Driven Architecture (MDA), which should beable to generate automatic code for Special Features Specification (SFS) ofOpen Geospatial Consortium (OGC). The extension was defined by the creationof a new cartridge to generate artifacts based on specification Model-To-Textand by revision of the generic meta-model, to make it adaptable to conceptualconstructions of geographical database.",
        "resumo": "Este artigo propõe uma extensão geográfica para uma ferramenta demodelagem de bancos de dados relacionais utilizando o Model-Driven Architec-ture (MDA), para ser capaz de gerar codificação automática para a Special Fea-tures Specification (SFS) da Open Geospacial Consortiun (OGC). A extensãofoi definida através da criação de um novo cartucho de geração de artefatosde texto baseado na especificação Model-To-Text e na revisão do meta-modelogenérico para ser adaptável às construções conceituais de banco de dados ge-ográficos."
    }
]