[
    {
        "abstract": "Urban transport is intrinsically linked to the operation of large citieswith dense traffic as an important factor in the generation of large jams, andlack of parking, among others. One solution to this problem is to share a ride(also called carpooling or ride sharing). The principle of carpooling exploresthe unused space available in private transport populating them with people oritems that have shared destinations. This study explores the challenges regar-ding: (i) the concept of carpooling; (ii) the problem of applying an algorithm toa road network; and (iii) other issues regarding GIS applications, consideringa university community in Brazil.",
        "resumo": "O transporte urbano está intrinsecamente ligado ao funcionamentode grandes metrópoles, tendo o tráfego denso como fator importante na geraçãode grandes congestionamentos, falta de estacionamentos, entre outros. Umapossı́vel solução para este problema é o compartilhamento de carona (tambémchamado de carona solidária ou agendamento de caronas) ou carpooling. Oprincı́pio do carpooling é aproveitar o espaço não usado mas disponı́vel emmeios de transporte privados populando-os com pessoas ou itens que têm des-tinos em comum. Este trabalho apresenta desafios considerando: (i) o conceitode carpooling; (ii) o problema de aplicar algoritmos a uma rede viária; e (iii)outras questões relacionadas a aplicações GIS, considerando uma comunidadeuniversitária brasileira."
    },
    {
        "abstract": "This paper presents an overview of logical modeling approaches forNoSQL data and other complex data models. We analyze conceptual andlogical models proposed by related work, and also transformation processbetween them. At the end of the paper, we suggest some guidelines for amethodology for a document NoSQL database logical design that considersthe contributions of these works.",
        "resumo": "Este artigo apresenta uma visão geral das abordagens paramodelagem lógica para dados NoSQL e para outros modelos de dadoscomplexos. Os modelos conceituais e lógicos propostos por trabalhosrelacionados são analisados, assim como os processos de transformação entreos modelos. Ao final do trabalho, sugere-se algumas diretrizes para umametodologia para o projeto lógico de banco de dados NoSQL de documentos,considerando as contribuições destes trabalhos."
    },
    {
        "abstract": "Organizations have computerized their processes through informa-tion systems, rural organizations have also followed this trend. With informati-zation, the amount of stored data has increased, and decision makers can sup-port on information obtained from the data stored. The stored data is associatedto the productivity of carrot and beet crops; and climate of the Rio Paranaíbaregion. These data are presented in forms of spreadsheets and are obtained fromdifferent sources, which makes the data analysis difficult. Therefore, the cons-truction of a structured data repository is essential to enable the analysis, whichaims to provide the information as a subsidy to decision makers in organizati-ons.",
        "resumo": "Organizações têm informatizado seus processos através de sistemasde informação, as organizações rurais também têm seguido essa tendência.Com a informatização, a quantidade de dados armazenados tem aumentado,e os tomadores de decisão podem apoiar em informações obtidas a partir dosdados armazenados. Os dados armazenados são associadas à produtividadedas lavouras de cenoura e de beterraba; e clima da região de Rio Paranaíba.Estes dados são apresentados em formas de folhas de cálculo e são obtidos apartir de fontes diferentes, o que torna difícil a análise de dados. Portanto, aconstrução de um repositório de dados estruturado é essencial para permitir aanálise, que tem como objetivo fornecer a informação como subsídio para ostomadores de decisão nas organizações."
    },
    {
        "abstract": "A scientific workflow entitled Net2Homology has been designed toappraise similarity among PPI (Protein-Protein Interaction) networks from twodifferent species and it establishes physical and functional frameworks amongthem. The Net2Homology also performs the data correlation among the NCBIand STRING’s database and one of its issues is the act of linking the proteinidentifiers derived from the PSI-BLAST and NCBI. We have used a localdatabase to integrate this information to a new Net2Homology version on theweb platform for the execution of the consultations of the protein-proteinnetwork interactions in the STRING’s database. This article proposes a localdatabase method to process, integrate and store proteins information on a newweb version of this program.",
        "resumo": "O programa Net2Homology é um workflow científico que realizacomparações entre redes de interação proteína-proteína, de duas espéciesdiferentes, identificando as estruturas físicas e/ou funcionais semelhantes entreelas. Para isso a ferramenta realiza a integração de dados entre os bancos dedados do NCBI e o banco de dados STRING. Um problema deste programaconsiste em vincular os identificadores de proteínas resultados do programaPSI-BLAST, do NCBI, para a realização das consultas das redes de interaçãoproteína-proteína no banco de dados STRING. Foi então realizada a utilizaçãode um banco de dados local (PostgreSQL) para integrar essas informações emuma nova versão da ferramenta Net2Homology na plataforma web."
    },
    {
        "abstract": "Several applications produce and manipulate today a large volume ofdata, known as Big Data. Traditional databases, in particular, Relational Data-bases (RDBs), are not able to manage Big Data. Because of this, new data mo-dels have been proposed for manipulating large data sets, with focus on scala-bility and availability. Most of this data models belongs to the so-called NoSQLDBs. However, NoSQL DBs are not compatible, in general, with the SQL stan-dard, and developers that use RDBs have to learn new models and access in-terfaces to develop Big Data-based applications. To deal with this problematic,approaches have been proposed to support the interoperability between SQLand NoSQL DBs. This work presents a comparative analysis of some relatedapproaches for all people interested in this subject. We also intend to contributeto the research for a relational-to-NoSQL data and operations’ interoperabilitysolution.",
        "resumo": "Diversas aplicações atualmente produzem e manipulam um grandevolume de dados, denominados Big Data. Bancos de dados tradicionais, emparticular, os Bancos de Dados Relacionais (BDRs), não são adequados ao ge-renciamento de Big Data. Devido a isso, novos modelos de dados têm sido pro-postos para manipular grandes massas de dados, enfatizando a escabilidade ea disponibilidade. A maioria destes modelos de dados pertence a uma nova ca-tegoria de gerenciadores de dados denominados BDs NoSQL. Entretanto, BDsNoSQL não são compatı́veis, em geral, com o padrão SQL e desenvolvedoresque utilizam BDRs necessitam aprender novos modelos de dados e interfaces deacesso para produzirem aplicações baseadas em Big Data. Para lidar com estaproblemática, abordagens têm sido propostas para o suporte da interoperabi-lidade entre BDRs e BDs NoSQL. Este artigo apresenta uma análise compara-tiva de algumas destas abordagens para todos aqueles interessados no assunto.Pretende-se ainda contribuir para a pesquisa direcionada ao desenvolvimentode uma solução para a interoperabilidade de dados e operações entre BDRs eBDs NoSQL."
    },
    {
        "abstract": "This paper presents a tool for database modeling constructed basedon MDA approach called GenDBM Tool, that is a set of plug-ins for theEclipse IDE based on the conceptual modeling of relational and geographicdatabase, thus the code generation following the SQL/SFS and ANSI SQLstandards. For this, it is used a generic metamodel, which gathers conceptsfrom the geographic and relational modeling notation, that are definedaccording with the metamodel and submitted to a set of M2T transformationsrules, generating the code for the database implementation. This paper alsopresents some examples using the GenDBM Tool and compares its principalfeatures with other tools that have the same purpose.",
        "resumo": "Este artigo apresenta uma ferramenta para modelagem de banco dedados construída com base na abordagem MDA chamada GenDBM Tool, queé um conjunto de plug-ins para o IDE Eclipse, voltada para modelagemconceitual de banco de dados relacional e geográfico, assim como a geraçãode código no padrão ANSI SQL/DDL e SQL/SFS. Para isso é utilizado oGEDBM, meta-modelo genérico que reúne conceitos das notações demodelagem para banco de dados relacionais e geográficos, sendo os modelosdefinidos de acordo com o mesmo e submetidos a um conjunto de regras detransformação M2T, gerando o código para a implementação da base dedados. São apresentados alguns exemplos de utilização da GenDBM Tool etraçados comparativos das suas principais característica em relação aalgumas ferramentas voltadas para o mesmo fim."
    },
    {
        "abstract": "The knowledge about the biodiversity of a given area is importantfor its conservation and management. The specie classification requiresspecific background by the researcher in addition to the analysis of severalmorphological characteristics. Thus, data mining approaches can assist inthis assignment by reducing the number of features which should be analyzed.Furthermore, it can be supportive for beginner researchers. The present paperdescribes the application of decision trees in the species classification. Intotal, 213 records of species, each one with 15 visual attributes have beenused in the our experiments. The attributes ventral stripe color, head color,bel underside of wings and details of tail were those used to build the decisiontree.",
        "resumo": "A conservação e manejo de uma área relacionam-se com oconhecimento da biodiversidade local. A identificação de uma espécie requerconhecimento prévio por parte do pesquisador, além da análise de múltiplascaracterísticas morfológicas. A mineração de dados contribui neste processoreduzindo o número de características a serem analisadas e/ou auxiliarpesquisadores principiantes. O presente trabalho propõe a aplicação datécnica de árvores de decisão na classificação das espécies de Aves da ordemFalconiformes. Foram utilizados 213 exemplos e 15 atributos visuais, sendoos que apresentaram maior capacidade de classificação foram: cor das listrasventrais, cor da cabeça, parte inferior da asa e detalhes da cauda."
    },
    {
        "abstract": "This work presents some possibilities generated by the application ofUbiquitous Computing technologies in Recommender Systems. Initially, themain concepts related to these areas are introduced. After, examples ofRecommender Systems that use Ubiquitous Computing technologies arepresented. Finally, prospects and challenges are discussed.",
        "resumo": "Este trabalho apresenta algumas das possibilidades geradas pelaintegração entre as tecnologias relacionadas à Computação Ubíqua e osSistemas de Recomendação. Inicialmente é feita uma breve caracterizaçãodestas duas áreas. Após, são apresentados Sistemas de Recomendação queutilizam, em algum grau, os recursos relacionados à Computação Ubíqua.Finalmente são discutidos perspectivas e desafios."
    },
    {
        "abstract": "Schema mappings are high-level specifications that describe the re-lationship between schemas. In real-life applications schema mappings can bequite complex and, then, users must know very well schemas to be matched.However, there exist applications that users know very well the domain but de-tails of the schemas are not known. Thus, tools that can build a target schemabased on samples are demanded by users not experts in computer science butexperts in the application domain. This paper studies and analyses three ap-proaches to build a schema based on a source schema and a set of samples. Wepresent algorithms and features of each approach as well a comparison betweenthem.",
        "resumo": "Correspondência entre esquemas são especificações de alto nı́vel cujoobjetivo é descrever os relacionamentos entre os esquemas. Em aplicações re-ais, a correspondência é uma tarefa muito complexa que exige conhecimentopreciso dos esquemas envolvidos. Porém, em algumas aplicações, os usuáriossão especialistas no domı́nio mas desconhecedores da estrutura do banco dedados. Assim, ferramentas que constroem correspondências baseadas em amos-tras são utilizadas cada vez mais por usuários não experientes em computaçãomas que pretendem construir seus próprios bancos de dados a partir de umbanco de dados existente e amostras de tuplas que formarão o novo banco dedados. Este trabalho tem como objetivo apresentar a análise de três ferramen-tas para este fim, através do estudo de seus algoritmos e caracterı́sticas."
    },
    {
        "abstract": "In the present days, the volumes of data generated and stored byorganizations are growing disproportionately. This situation comes along withbig challenges, like the integration and transformation of this data in relevantinformation to optimize the process of decision-making. So it’s necessary tobuild a knowledge base to integrate and organize the available data in orderto make them easy to understand and allow the quick access, enablingexploitation and analysis of data in order to meet the strategic expectations oforganizations. In this scenario, this paper presenting an approach forimplement Business Intelligence in the UNIPAMPA, aiming to significantlyimprove the resource management application in the organization.",
        "resumo": "Atualmente, os volumes de dados gerados e armazenados pelasorganizações estão crescendo de forma desmesurada. Esta situação, vemacompanhada de grandes desafios, entre eles, a integração e transformaçãodestes dados em informações relevantes para aprimoramento do processodecisório Desta forma, faz-se necessária a execução de um complexo processopara organizar e integrar os dados disponíveis de forma facilmente entendidae que permita o acesso rápido, possibilitando a exploração e análise de dadosa fim de atender as expectativas estratégicas das organizações. Neste cenário,este trabalho apresenta uma abordagem para implementação de BusinessIntelligence dentro de uma instituição federal de ensino superior, a fim deotimizar a aplicação de seus recursos."
    },
    {
        "abstract": "This paper presents a Domain-Specific Language for reverseengineering database systems which uses a generic metamodel for relationaland geographical databases. The developed tool for Eclipse uses an integratedset of tools in order to automatically generate conceptual models using Entity-Relationship models and the OMT-G model.",
        "resumo": "Este artigo apresenta uma Linguagem de Domínio Específica paraengenharia reversa de sistemas de banco de dados que utiliza um meta-modelo genérico para banco de dados relacionais e geográficos. A ferramentadesenvolvida para o Eclipse usa um conjunto de ferramentas integradas com oobjetivo de gerar automaticamente modelos conceituais usando o modeloEntidade-Relacionamento e o OMT-G."
    },
    {
        "resumo": "A disseminação do modelo RDF como formato de publicação de da-dos na Web requer novas formas de armazenamento. Sistemas NoSQL têm sidoaplicados para dar suporte a fontes de dados RDF de larga escala, enquantoSGBDs relacionais vêm sendo utilizados para conjuntos de dados de menorporte. No uso de SGBDs relacionais para este propósito a ausência de umesquema RDF acarreta em uma sub-utilização das composições do modelo re-lacional. Este artigo apresenta ntSQL, uma ferramenta que automaticamenteextrai o esquema de um documento RDF em formato NT a fim de produzir umbanco de dados relacional equivalente. O artigo descreve as etapas deste pro-cesso, bem como resultados preliminares quanto ao desempenho da ferramenta."
    },
    {
        "abstract": "This paper describes the development of a Business Intelligence webapplication compatible with mobile devices. The advancement of these types ofdevices allowed enterprises to have quick and convenient access to theinformation available from anywhere. The information available in analyticaltools through graphics makes better the decision making.",
        "resumo": "Este artigo descreve o desenvolvimento de uma aplicação webBusiness Intelligence compatível com dispositivos móveis. O avanço destestipos de dispositivos permitiu às empresas ter acesso rápido e conveniente dasinformações disponíveis a partir de qualquer lugar. A informação disponívelem ferramentas analíticas através de gráficos torna melhor a tomada dedecisões."
    }
]