[
    {
        "abstract": "The text combines knowledge discovery and extraction techniques ofinformation retrieval, natural language processing and summarization ofdocuments with data mining methods. For dealing with unstructured data, textknowledge discovery is considered more complex than the knowledgediscovery in databases. Through articles related to the field of biology, textmining techniques will be applied, combined with the Cross-Industry StandardProcess methodology for Data Mining, in order to find the specific words thatfield of knowledge, thus facilitating decision-making of the words eventuallychosen by students with physical disabilities during the writing process.",
        "resumo": "A descoberta de conhecimento em texto combina técnicas deextração e de recuperação da informação, processamento da linguagemnatural e sumarização de documentos com métodos de Data Mining. Por lidarcom dados não-estruturados, a descoberta de conhecimento em texto éconsiderada mais complexa que a descoberta de conhecimento em base dedados. Através de artigos relacionados ao campo da biologia, serão aplicadasas técnicas de mineração de texto, combinadas com a metodologia Cross-Industry Standard Process for Data Mining, com o objetivo de encontrar aspalavras específicas desse campo de conhecimento, facilitando assim atomada de decisão das palavras a serem escolhidas por alunos comdeficiência motora durante o processo de escrita."
    },
    {
        "abstract": "The limited human capacity to analyze and obtain information fromlarge volumes of data in a timely manner requires the use of techniques andtools of knowledge discovery in databases. This paper presents a review and astudy in data mining algorithms implemented in PHP to run on the Web,aiming to demonstrate the feasibility of using these tools for data mining task.",
        "resumo": "A limitada capacidade humana de analisar e obter informações apartir de grandes volumes de dados em um tempo hábil exige a utilização detécnicas e ferramentas de descoberta de conhecimento em banco de dados.Este trabalho apresenta uma revisão e um estudo sobre algoritmos demineração de dados implementados em PHP para execução na Web, visandodemonstrar a viabilidade da utilização destas ferramentas para tarefa demineração de dados."
    },
    {
        "abstract": "Nowadays, an increasing amount of data are becoming available inRDF format. In order to provide suitable database systems to manage RDF data,there are approaches adapting relational database systems to process RDF, orusing NoSQL systems to deal with the large volume of some RDF datasets. Thispaper presents an experimental study which compares two models of relationalsystems in this context. The first model, named triple-store, is a simple solutionthat converts an RDF dataset to a relation. The second model is based on theRDF structure to provide a more appropriate relation schema. These modelsare represented in the experiments by the systems Jena-TDB Fuseki and ntSQL,respectively. The results reported that the relational schema applied by ntSQLprovides better response time in SPARQL queries than compared to the schemaof a triple-store.",
        "resumo": "Atualmente, observa-se um volume crescente de dados sendo publi-cado no formato RDF. Para prover sistemas de bancos de dados adequados paragerenciar este tipo de dados, as soluções partem de adaptações dos SGBDs rela-cionais para suportar RDF, assim como sistemas NoSQL para suprir a demandado volume de algumas bases de dados deste tipo. Este artigo apresenta um es-tudo experimental que compara dois modelos de sistemas relacionais neste con-texto. O primeiro destes modelos, conhecido como triple-store, é uma soluçãosimples que transforma uma fonte RDF em uma tabela. O segundo modelo uti-liza noções da estrutura RDF para propor um esquema relacional mais robusto.Estes modelos são representados nos experimentos pelos sistemas Jena-TDBFuseki e o ntSQL, respectivamente. Os resultados obtidos demonstram que ouso de um esquema relacional mais robusto, como o obtido pelo ntSQL, confereum melhor desempenho em consultas SPARQL submetidas a estes repositórios."
    },
    {
        "abstract": "Column oriented databases belong to a kind of NoSQL database inwhich the values of the same column are stored contiguously in secondary me-mory. This physical organization favors compression, mainly because the proxi-mity of data of the same nature decreases the information entropy. With respectto high cardinality columns that store text, several compression methods can beused. One of them, called PPM, is usually good in obtaining high compressionrates, but the execution time is poor for conventional files. The purpose of thispaper is to analyze whether this compression method is able to explore the na-ture of column oriented data to obtain more expressive results in comparisonwith is main competitors.",
        "resumo": "Bancos de dados orientados a colunas pertencem a um tipo de bancoNoSQL em que os valores de uma mesma coluna são armazenados contigua-mente em memória secundária. Essa organização fı́sica favorece a compressão,uma vez que a aproximação dos dados de mesma natureza diminui a entropia dainformação. Considerando especificamente colunas de alta cardinalidade quearmazenam texto, diversos tipos de compressores podem ser usados. Um deles,chamado PPM, costuma obter boas taxas de compressão, mas possui um tempode processamento considerado alto para arquivos convencionais. O objetivodesse artigo é verificar se esse método consegue explorar a natureza dos dadosorientados a coluna de forma a obter resultados mais expressivos em relaçãoaos seus concorrentes."
    },
    {
        "abstract": "Among the projects in development on Fabrica de Software environ-ment at the Catarinense Federal Institute, one is about a traffic managementsupport system. In this project, the import of an external, too large, and unstruc-tured file data to an internal SQL database is required. The use of a frameworkDjango to import this data obtained a low performance result. Then, new im-port strategies were desirable. Thus, this work deals with the optimization ofdata import strategies used to solve this problem, by presenting the proposedsolutions and comparing their performance results.",
        "resumo": "Dentre os projetos desenvolvidos no ambiente da Fábrica de Softwaredo Instituto Federal Catarinense, um trata de um sistema de gestão de trânsito.No âmbito desse projeto, é necessário importar uma base de dados externamuito grande e não estruturada para uma base interna em SQL. A utilizaçãode um framework Django para a importação dos dados resultou em baixo de-sempenho, iniciando a busca por novas estratégias de importação. Assim, essetrabalho trata da otimização das estratégias de importação de dados utilizadaspara a resolução desse problema, apresentando as soluções propostas e com-parando o desempenho dos resultados."
    },
    {
        "abstract": "Redundant and often incomplete information substantially reducesthe productivity provided by mobile devices. This paper specifies a method toindentify duplicate contacts from different data sources, such as e-mailaccounts, social networks and those manually set by the user. Using multiplesimilarity functions, stored records are reorganized in groups of contactsrepresenting the same person or organization. The experiments showed thatthe proposed method correctly identified up to 76% of duplicated contacts.",
        "resumo": "Informações redundantes e muitas vezes incompletas reduzemconsideravelmente a produtividade oferecida pelos dispositivos móveis. Esteartigo especifica um método para identificar contatos duplicados coletados defontes de dados distintas, tais como contas de e-mail, redes sociais e aquelesinseridos manualmente pelo usuário do dispositivo. Utilizando múltiplasfunções de similaridade, os registros armazenados são reorganizados emgrupos de contatos que representam a mesma pessoa ou organização. Osexperimentos realizados mostraram que o método proposto identificoucorretamente até 76% dos contatos similares duplicados."
    },
    {
        "abstract": "This paper presents a tool that implements OLAP operations underNoSQL DB MongoDB using Map Reduce model. The goal of this tool is toidentify the performance of OLAP operations dice, slice, drill-down and roll-upexecuting in single and multiple nodes. Our results show that, when executingin multiple nodes, the peformance is 30% faster in the worse case.",
        "resumo": "Este artigo apresenta uma ferramenta que implementa os operadoresOLAP executados no banco de dados NoSQL MongoDB utilizando o modelode programação Map Reduce. Os operadores implementados são: dice, slice,drill-down e roll-up. O objetivo é identificar o desempenho de tais operadoresem banco de dados NoSQL executando em um nó simples e em múltiplos nós.Os resultados indicam que há um ganho de mais 30% no desempenho para opior caso em múltiplos nós ."
    },
    {
        "abstract": "Recent years have witnessed the emergence of new models of databa-ses. These models, known as NoSQL, are characterized by not having a formalstructure, not providing access via SQL, being distributed and promising greaterscalability and performance. When popularized, these models originated a gapin terms of data analysis, since the data mining tools were usually designed to beapplied to relational models, not to the unstructured or semi-structured data. Tothat end this paper performs a search involving data mining to semi-structured /unstructured data limited to the scope of possible data formats stored in NoSQL.",
        "resumo": "Nas últimas décadas houve o surgimento de novos modelos de ba-ses de dados. Estes modelos, conhecidos como NoSQL, se caracterizam pornão possuı́rem uma estrutura formal, não fornecerem acesso via SQL, seremdistribuı́dos e prometerem maior escalabilidade e desempenho. Ao se popula-rizarem originaram uma lacuna em termos de análise de dados, visto que asferramentas de mineração de dados, por exemplo, usualmente foram desenvol-vidas para serem aplicadas a modelos relacionais, não a dados sem estrutura ousemi-estruturados. Nesse intuito o presente trabalho realiza uma pesquisa emmineração de dados semi-estruturados/ não-estruturados limitados ao escopodos possı́veis formatos de dados armazenados em NoSQL."
    },
    {
        "abstract": "The recent increased use of digital social media in the company’severy day raised interest in the study of techniques to obtain knowledge basedon text messages. This work describes the Opinion Mining in microblogs basedon CESA (Crowd Explicit Sentiment Analysis) applied in a data set formed byfollowers posts of True Blood series. Rating Feeling is performed by a succes-sion of Latent Semantic Analysis and projection of sentences on the polarizedindex of terms. Experiment results show an overall efficiency about 81% rea-ching 86% for positive polarity words.",
        "resumo": "O crescente uso das mı́dias sociais digitais no cotidiano da sociedadetem estimulado o estudo de técnicas para obtenção de conhecimento baseadoem postagens de texto. Este trabalho contempla a Mineração de Opiniões emmicroblogs por meio da CESA (Crowd Explicit Sentiment Analysis) aplicadaem uma base de postagens dos fãs do seriado “True Blood”. A Classificaçãode Sentimento é realizada pela sucessão da Análise Semântica Latente e daprojeção de sentenças em ı́ndices de termos polarizados. Os resultados obti-dos no experimento mostraram eficiência geral de 81% alcançando 86% parapalavras polarizadas positivamente."
    },
    {
        "abstract": "This paper describes a case study that evaluates a data sample in itscurrent stage, in real systems that deeply depend on reliable data inside afinancial institution. This way, a process is proposed here for the data qualityassessment based on methods and processes surveyed in literature. Thedefinition of a data sample, dimensions, quality metrics and relevant rules tothe business context, as well as data measurement and analysis of the resultswere performed here. After the evaluation it is possible to draw action plans,aiming the continuous improvement of the data. Action plans are not part ofthis paper.",
        "resumo": "Este trabalho descreve um estudo de caso para efetuar a avaliaçãodo estado atual de uma amostra de dados, contidos em sistemas reais quedependem fundamentalmente de dados confiáveis, dentro de uma instituiçãofinanceira. Dessa forma, é proposto um processo para a avaliação daqualidade dos dados tomando como base métodos e processos pesquisados naliteratura. A definição de uma amostra de dados, de dimensões, de métricas ede regras de qualidade relevantes ao contexto do negócio, bem como amedição dos dados e análise dos resultados foram executados. Após aavaliação é possível traçar planos de ação, visando a melhoria contínua dosdados. Os planos de ação não fazem parte dessa pesquisa."
    },
    {
        "abstract": "In this paper we collect the information in the Lattes Curriculum of382 Brazilian researchers CNPq productivity to the area of Computer Science.This information was stored in a XML file. We propose a approach to identifythe profile of researchers using Data Science tecniques. The largest contributionpresented is an improvement in the Rep-Index metric. Such improvement allowsbetter classification of researchers from the original index. We found some dis-parities in favor of males and more developed regions such as the Southeast andSouth of Brazil.",
        "resumo": "Neste artigo coletamos as informações do Currı́culo Lattes de 382pesquisadores brasileiros de produtividade do CNPq para a área de Ciência daComputação. Essas informações foram armazenadas em um arquivo XML. Pro-pomos uma abordagem a fim de identificar o perfil dos pesquisadores utilizandotécnicas de Data Science. A maior contribuição apresentada é uma melho-ria na métrica Rep-Index. Tal melhoramento permite aumentar a qualidade daclassificação dos pesquisadores em relação ao ı́ndice original. Encontramos al-gumas disparidades a favor do gênero masculino e regiões mais desenvolvidascomo o Sudeste e Sul."
    },
    {
        "abstract": "Much of recent research is done towards improving Content-BasedMedical Image Retrieval (CBMIR) systems. Among the open challenges, it isnecessary to provide an interface with resources accessible for end users (likemedical specialists) to define tasks related to image similarity. Furthermore, thehigh cost of image processing tasks as well as the always increasing sizes of thedatasets demand that new solutions be scalable. Based upon these requirements,this work presents a proposal that makes use of a workflow system and a parallelprocessing framework to provide an environment in which end users can easilyconduct experiments regarding image similarity over large datasets. A prototypeof the environment was developed, allowing the definition of pipelines for imageretrieval that are executed over Apache Spark, having achieved linear horizontalscalability in a tested sequence of tasks.",
        "resumo": "Recentemente, tem-se realizado muitos esforços de pesquisa para amelhoria de Sistemas para a Recuperação de Imagens Médicas com Base emConteúdo (CBMIR). Dentre os desafios em aberto, é necessário prover uma in-terface com recursos acessı́veis aos usuários finais (como especialistas médicos)definirem tarefas relacionadas à similaridade de imagens. Além disso, o altocusto das tarefas relacionadas ao processamento de imagens, assim como aexistência de conjuntos de dados cada vez maiores exigem que novas soluçõessejam escaláveis. Com base nesses requisitos, este trabalho apresenta uma pro-posta que faz uso de um sistema de workflows e de um framework para proces-samento paralelo a fim de prover um ambiente em que usuários finais possamconduzir experimentos em similaridade de imagens sobre grandes conjuntos dedados. Foi desenvolvido um protótipo do ambiente, que permite definir pipe-lines de recuperação de imagens que são executados sobre o Apache Spark,tendo alcançado escalabilidade horizontal linear em uma sequência de tarefasavaliada."
    },
    {
        "resumo": "Análise exploratória se tornou uma ferramenta essencial em di-versos processos de análise de dados. No contexto de redes complexas, aalta dimensionalidade dos dados e diversidade dos relacionamentos dificultainterações exploratórias. Este desafio é ainda maior em interações que com-binem navegação, seleção e análise dos dados – uma combinação tı́pica nasinvestigações. Inspirados na interação oferecida pelos mecanismos de OLAPno mundo relacional, nosso objetivo neste trabalho é propor mecanismos equi-valentes para análise de redes complexas. Nossa proposta inclui um modelode operações exploratórias, respectivos elementos visuais, e arquitetura do sis-tema. A proposta está baseada na Beta álgebra e mecanismos de consulta e ge-renciamento desenvolvidos no contexto do CDMS (Complex Data ManagementSystem). Ilustramos nossa proposta com um caso de uso baseado em dadosabertos."
    },
    {
        "abstract": "This paper presents an on-going research that explores open dataabout trade permits from the city of Curitiba over more than three decades.In particular, we aim at performing an analysis of three districts, taking advan-tage of GIS techniques and data science. As a result of this study we present apreliminary analysis of economic development city.",
        "resumo": "Este artigo apresenta uma pesquisa em andamento que explora dadosabertos sobre alvarás na cidade de Curitiba ao longo de mais de três décadas.Em particular, temos como objetivo fazer uma análise de três bairros, tirandoproveito de técnicas de geoprocessamento e ciência de dados. Como resultadodeste estudo apresentamos uma análise preliminar da evolução econômica dacidade."
    },
    {
        "abstract": "This paper describes a Business Intelligence Application fordecision-making in a higher education institution. The strategy adopted isdescribed considering the business areas. The DataUSP main differential is inthe best characterization of the indicator that is defined as quantifiablerepresentation forms of services characteristics or processes, to monitor andimprove results over time.",
        "resumo": "Este artigo descreve uma aplicação de Business Intelligence paratomada de decisões em uma instituição de ensino superior. A estratégiaadotada é descrita considerando as áreas de negócio. O maior diferencial doDataUSP está em caracterizar bem o indicador, que é definido como formasde representação quantificável de características de serviços ou processos,utilizado para acompanhar e melhorar os resultados ao longo do tempo."
    },
    {
        "abstract": "This paper presents an application for contact deduplication onAndroid devices called DeDup. This tool identifies duplicate contactscollected from different sources, such as e-mail accounts and social networks.Using multiple similarity functions, stored records are reorganized in groupsof contacts representing the same person or organization.",
        "resumo": "Este artigo apresenta um aplicativo para deduplicação de contatosem dispositivos Android denominado DeDup.1Esta ferramenta identificacontatos duplicados provenientes de diferentes fontes, tais como contas de e-mail e redes sociais. Utilizando múltiplas funções de similaridade, os registrosarmazenados são reorganizados em grupos de contatos que representam amesma pessoa ou organização."
    },
    {
        "abstract": "This paper presents an ongoing development of an application toautomatically migrate from an existing relational data model in a database toa graph-oriented model. The application is responsible for communicating withthe existing database, collecting metadata and generating a graph-orientedmodel that accurately represents the original one.",
        "resumo": "Este artigo apresenta o desenvolvimento em andamento de umaaplicação com o propósito de realizar automaticamente a migração de ummodelo de dados relacional já existente em uma base de dados para um modeloorientado a grafos. A aplicação é responsável por se comunicar com a baseexistente, coletar metadados e gerar um modelo orientado a grafos querepresenta fielmente o original."
    },
    {
        "abstract": "The number of women in computer science is still low compared tothe total number of professionals within this area. Several actions are being heldin Brazil and other countries to reverse this scenario. In this paper, we presentone of such actions in the context of a project, which aims to bring computerscience to female high school students in Curitiba - Brazil.",
        "resumo": "O número de mulheres na computação ainda é baixo se comparadoao número total de profissionais nesta área. Várias ações estão sendo real-izadas no Brasil e em outros paı́ses para reverter este cenário. Este trabalhorelata uma das atividades de um projeto que tem como objetivo apresentar asdiferentes facetas da computação para estudantes femininas do ensino médio deuma escola pública em Curitiba - Brasil."
    },
    {
        "abstract": "This short paper reports the development of a tool to assist resear-chers at Science Data in extraction of data from XML files to software Weka andR. We use the query language XQuery to recover the information. The proposedtool performs an automated process of data analysis. Finally there is the pos-sibility of exporting data in native format for softwares such Weka and R. Thisautomation results in a significant reduction of time between data retrieval andprocessing when compared to manual processing.",
        "resumo": "Este artigo relata o desenvolvimento de uma ferramenta para auxiliaros pesquisadores de Data Science na extração de dados em arquivos XML paraos softwares Weka e R. Utilizamos a linguagem de consulta XQuery para recupe-rarmos as informações. A ferramenta proposta executa um processo automati-zado de análise dos dados. Finalmente existe a possibilidade de exportação dosdados em formatos nativos para softwares como Weka e R. Essa automatizaçãoresulta em uma redução significativa de tempo entre a recuperação dos dados eseu processamento quando comparado ao processamento manual."
    }
]