[
    {
        "abstract": "The Recommendation Systems seek to suggest relevant information tousers. In the context of researchers there are numerous approaches proposedto recommend articles and citations. The objective of this work is to presenta strategy of recommendation approach focused on the career projection of re-searchers. As a result, we obtained the best combination for subarea profilesimilarity with Log-likelihood and Apache Mahout’s ClassicAnalyzer class. Re-garding the recommendations, two different types of recommendation were ge-nerated for several test groups. The results were satisfactory and show that theproposed approach has good coverage in the generation of recommendations.",
        "resumo": "Os Sistemas de Recomendação procuram sugerir informações rele-vantes aos usuários. No contexto dos pesquisadores existem inúmeras abor-dagens propostas para recomendar artigos e citações. O objetivo deste traba-lho é apresentar uma estratégia de abordagem para recomendação com focona projeção da carreira de pesquisadores. Como resultados, obtivemos a me-lhor combinação para similaridade de perfil de subárea com Log-likelihood ea classe ClassicAnalyzer do Apache Mahout. Com relação as recomendações,foram geradas dois tipos diferentes de recomendação para diversos grupos detestes. Os resultados foram satisfatórios e demostram que a abordagem pro-posta tem boa cobertura na geração de recomendações."
    },
    {
        "abstract": "JSON (JavaScript Object Notation) is a format for representation andinterchange of complex and heterogeneous data that is becoming very popular.In this context, initiatives related to the integration or querying of large volumesof JSON data must deal with the problem of defining an unified schema for aset of relevant JSON documents. This paper aims to present a review on schemaextraction from document in JSON format. The contributions of the paper arethe presentation of approaches related to the theme as well as a comparativeanalysis of them.",
        "resumo": "JSON (JavaScript Object Notation) é um formato de representação eintercâmbio de dados complexos e heterogêneos que vem crescendo empopularidade. Nesse sentido, iniciativas no sentido de integrar ou consultargrandes volumes de dados neste formato se deparam com a problemática dedefinir um esquema unificado para um conjunto de documentos JSON deinteresse. Este artigo tem por objetivo apresentar um levantamento sobreextração de esquemas de documentos em formato JSON. As contribuições desteartigo são a apresentação de abordagens relacionados ao tema e uma análisecomparativa destas abordagens."
    },
    {
        "abstract": "The use of databases in business is fundamental to decision talking,but the information extraction in DBMS could use techniques, to make a smartsearch. Searches that use relational operators are limited when there are ty-pos or when the database is inconsistent. To correct this, some systems havefunctions that allow you to search based on the similarity of strings, for exam-ple, searches based on phonetic algorithms such as Soundex and Metaphone,but both methods are unusual in languages other than English and thereforeneed of an adaptation. The algorithm calculating the distance between strings,based on calculating the Levenshtein distance, another alternative is to find si-milarities between two strings. In this context, it is necessary to identify whichalgorithm is more efficient both in performance and in the accuracy of the datareturned. Furthermore, it should be considered that the efficiency varies withthe database, and if hybrid methods are the best alternative.",
        "resumo": "A utilização bancos de dados nas empresas é fundamental para to-mada de decisões, porém a recuperação de informações nos SGBD poderiautilizar técnicas para tornar as buscas mais inteligentes. As buscas que utili-zam operadores relacionais são limitadas quando ocorrem erros de digitaçãoou quando a base de dados está inconsistente. Para suprir esta deficiência,alguns sistemas possuem funções que permitem fazer buscas baseadas na simi-laridade das strings, por exemplo, as buscas baseadas em algoritmos fonéticoscomo o Soundex e o Metaphone, porém ambos os métodos não são usuais emidiomas diferentes do inglês e precisam, portanto, de uma adaptação. O al-goritmo do cálculo da distância entre strings, baseado no cálculo da distânciade Levenshtein, é outra alternativa para encontrar similaridades entre duas ca-deias de caracteres. Neste contexto, é necessário identificar qual algoritmo é omais eficiente, tanto na performance quanto na precisão dos dados retornados.Além disso, deve ser analisado se a eficiência varia de acordo com a base dedados, e se os métodos hı́bridos são a melhor alternativa."
    },
    {
        "abstract": "Online data blocking aims to identify records that represent the samepurpose on a streaming data environment. Real-time data blocking must be ableto process a range of informations with a high effectiveness and no delays. Thepurpose of this paper is to introduce a developed tool named Redblock for real-time data deduplication using a distributed platform for online processementcombined with a data blocking technique that make use of an Inverted Index.The tool managed to provide good preliminary results in terms of effectivenessin a synthetic database.",
        "resumo": "A blocagem online de dados tem como propósito identificar regis-tros que representam um mesmo objetivo em ambientes com fluxo contı́nuode dados. A blocagem online deve ser capaz de processar volumes variadosde informações, sem atrasos e com uma alta eficácia. Este trabalho, propõeuma ferramenta intitulada Redblock para a deduplicação de dados em temporeal. A ferramenta utiliza uma plataforma distribuı́da de processamento on-line em conjunto com um método de blocagem utilizando ı́ndice invertido. Naexperimentação, Redblock demonstrou bons resultados preliminares em relaçãoa sua eficácia em uma base de dados sintética."
    },
    {
        "abstract": "This paper presents an application that use technologies related toUbiquitous and Mobile Computing for recommending posters to conferenceparticipants. In the work, posters are Smart Posters – posters that has affixedto or embedded in it, one or more readable NFC tags. Together with NFC,techniques used in Recommender Systems have been explored. The applicationshows more information about a poster that a user is viewing, allows that auser to evaluate the poster, and recommend other posters available at theevent, take into account the user location.",
        "resumo": "Este artigo apresenta uma aplicação que explora recursos daComputação Ubíqua e Móvel para construção de um sistema que realiza arecomendação de pôsteres aos participantes de uma conferência. Para fazeristo são usados Smart Posters - pôsteres que possuem afixados ou embutidosuma ou mais etiquetas NFC. Junto com NFC, diferentes técnicas utilizadas emSistemas de Recomendação foram exploradas. A partir disto, a aplicaçãoexibe informações adicionais sobre um pôster que o usuário de um eventoconsulta, permite que o usuário avalie o pôster e recomenda outros pôsteresdisponíveis no evento, considerando a localização do usuário."
    },
    {
        "abstract": "With decreasing costs of tracking devices and their availability invehicles, smartphones and other devices, there is an increase of spatio-temporaldata, which can be mined to find patterns regarding groups of moving objects.Among such patterns is the flock pattern that can be defined as a minimal num-ber of entities within a defined distance radius moving together during a cer-tain time-window. However, collection of object positions is usually irregulardue to problems such as system failures or passing through tunnels or under-ground, resulting in gaps in trajectories that may preclude detection of movingpatterns. One technique to address this problem is path interpolation, whichgeometrically generates the missing spatio-temporal points using a given esti-mation method. The objective of this work is the implementation and evaluationof the inclusion of interpolation techniques for the treatment of entries for on-line flock pattern algorithms. We present experiments that showed good resultson finding flock patterns by applying interpolation compared to the results ofutilizing the original datasets.",
        "resumo": "Com a redução de custo e a maior disponibilidade de dispositivosde localização em veı́culos, smartphones e outros aparelhos, há um aumentode dados espaço-temporais, que podem ser minerados a fim de se encontrarpadrões em grupos de objetos em movimento. Entre esses padrões está o padrãoflock, que pode ser definido como um número mı́nimo de entidades dentro de umespaço delimitado por uma circunferência de raio definido que se deslocamjuntos por um certo intervalo de tempo. No entanto, a coleta de posições deobjetos é usualmente irregular devido a problemas, como falha de sistema oufalha por passagem em túneis, resultando em perdas nas trajetórias coletadasque podem impedir a identificação de padrões de movimentação. Uma soluçãopara este problema é a interpolação de pontos que calcula geometricamenteos pontos faltantes utilizando algum método de estimativa. O objetivo destetrabalho é a implementação e avaliação da inclusão de técnicas de interpolaçãopara o tratamento de entradas para algoritmos de descoberta on-line do padrãoflock. São apresentados experimentos que mostraram bons resultados na buscapor padrões flock aplicando-se interpolação quando comparados aos resultadosutilizando as bases de dados originais."
    },
    {
        "abstract": "Key-value databases emerge to address relational databases’ limita-tions and with the increasing capacity of RAM memory it is possible to offergreater performance and versatility in data storage and processing. The ob-jective is to perform a comparative study of key-value databases with memorystorage Redis, Memcached, Voldemort, Aerospike, Hazelcast and Riak KV. Thus,the work contributed to an analysis of different databases and with results thatqualitatively demonstrated the characteristics and pointed out the main advan-tages.",
        "resumo": "Bancos de Dados (BD) chave-valor surgem para suprir limitações deBDs relacionais e com o aumento da capacidade das memórias RAM é possíveloferecer maior desempenho e versatilidade no armazenamento e processamentodos dados. O objetivo é realizar um estudo comparativo dos BDs chave-valorcom armazenamento em memória Redis, Memcached, Voldemort, Aerospike,Hazelcast e Riak KV. Assim, o trabalho contribuiu para uma análise de diferen-tes BDs e com resultados que demonstraram qualitativamente as característicase apontaram as principais vantagens."
    },
    {
        "abstract": "The Recommender Systems are responsible by assisting the users ininformation filtering process. This work reports the development of a graphi-cal user interface to recommender of Apache Mahout. We also propose a javaclass to access the data stored in relational data base through Object-RelationalMapping using the Hibernate framework. The first contribution of this workis the simplification of the user interaction with system, obtained through thegraphical user interface. The second is the flexibility and portability to differentrelational data base managers systems obtained through Hibernate.",
        "resumo": "Os Sistemas de Recomendações são responsáveis por auxiliar osusuários no processo de filtragem de informações. Este trabalho relata o desen-volvimento de uma interface gráfica para o recomendador do Apache Mahout.Também propomos uma classe java de acesso aos dados armazenados em bancode dados relacionais por meio do mapeamento objeto-relacional usando o fra-mework Hibernate. A primeira contribuição deste trabalho é a simplificação dainteração do usuário com o sistema, obtida pela interface gráfica. A segunda éa flexibilidade e portabilidade para diferentes gerenciadores de banco de dadosobtida por meio do Hibernate."
    },
    {
        "abstract": "The Action Plan at the Federal Institute Farroupilha CampusAlegrete consists in a sectors demands list. The demands are goods andservices purchase requests, which have a complex processing flow and are notalways properly monitored. This paper describes the web system developmentthat will allow the goods requests inclusion and also the demands flowmonitoring of the Action Plan. The system uses the graph model, which is aNoSQL database category. The main reason for choosing this model is thecharacterization of the system stored data, being basically generateddocuments among several flow steps.",
        "resumo": "O Plano de Ação no Instituto Federal Farroupilha Campus Alegreteconsiste em uma lista de demandas de um setor. As demandas são pedidos deaquisição de bens e serviços, que possuem um fluxo de tramitação complexo enem sempre tem o acompanhamento adequado. Este trabalho descreve odesenvolvimento de um sistema web que permitirá a inclusão de solicitaçõesde bens e também o acompanhamento do fluxo das demandas referentes aoPlano de Ação. O sistema utiliza o modelo de grafos, que é uma categoria debanco de dados NoSQL. O principal motivo da escolha desse modelo é acaracterização dos dados armazenados no sistema, sendo basicamentedocumentos gerados ao longo de fluxo de várias etapas."
    },
    {
        "abstract": "This article presents the gains obtained in an Information System ofa river basin with the application of an extension association for spatial datamanipulation in a database management system. It presents some spatial datamanipulation processes and their applications, which will ultimately allow abetter management decision-making, regarding the monitoring of phenomenainside the limits of the Taquari-Antas basin.",
        "resumo": "Este artigo apresenta os ganhos obtidos em um Sistema deInformações de uma bacia hidrográfica com a associação da extensão paramanipulação de dados espaciais PostGIS em um sistema gerenciador debanco de dados. Apresenta alguns processos de manipulação de dadosespaciais e suas aplicações, que irão em última instância, permitir umamelhor tomada de decisões gerenciais, no que se refere ao acompanhamentodos fenômenos ocorridos dentro dos limites da bacia Taquari-Antas."
    },
    {
        "abstract": "Every year, statistics demonstrate an increasingly growth aboutfatality in Rio Grande do Sul traffic. This paper shows a study mapping trafficfatal accident patterns occurred in Rio Grande do Sul and in Santa Mariafrom 2007 to February 2016, in order to identify their main factors. To do so,we applied a Knowledge Discovery in Databases process, by means of theexecution of Apriori and J48 algorithms in the WEKA tool. We employed amethodology with a extensive preprocessing, algorithm execution and aparticular analysis of the generated rules for knowledge mapping about fataltraffic accidents in Rio Grande do Sul.",
        "resumo": "A cada ano, estatísticas demonstram um aumento da fatalidade notrânsito do Rio Grande do Sul. Este trabalho apresenta um estudo paramapear os padrões de acidentes de trânsito com vítimas fatais ocorridos noRio Grande do Sul e em Santa Maria, entre 2007 e fevereiro de 2016, a fim deidentificar os principais fatores envolvidos. Para isso, é empregado umprocesso de Descoberta de Conhecimento em Bases de Dados, por meio daexecução dos algoritmos Apriori e J48, na ferramenta de mineração de dadosWEKA. É apresentada uma metodologia de extenso pré-processamento dosdados, execuções dos algoritmos e análises das regras geradas para ummapeamento dos conhecimentos adquiridos acerca dos acidentes de trânsito."
    },
    {
        "abstract": "This article describes the features and announces the beta release ofthe third version (v3) of the Brazilian database relational modeling tool,called brModelo. This tool is used in most of the brazilian educationalinstitutions that offer courses in information technology area, includingtechnical courses, degree coursers and university graduate courses. His greatcontribution is related to the teaching of Database design.",
        "resumo": "Este artigo descreve as funcionalidades e anuncia o lançamento daterceira versão (v3) da ferramenta de modelagem relacional de banco dedados, brModelo. Esta ferramenta é utilizada na maioria das instituições deensino brasileira que oferecem cursos na área de tecnologia da informação,incluindo cursos técnicos e profissionalizantes, de graduação e de pós-graduação. Sua grande contribuição é percebida no campo do ensino deprojeto de bancos de dados relacionais."
    },
    {
        "abstract": "The use of archive management system reduces the labor and cost ofinternal libraries. These systems mostly need to store the data in a metadatastandard for dealing with flexible and dynamic information such as MARC.Traditionally relational databases are used, most of which have rigidstructures for data storage. The purpose of this study was to compare theperformance of DBMS's PostgreSQL and MongoDB for storage and searchMARC metadata.",
        "resumo": "A utilização de sistemas de gestão de acervo reduz o trabalho e ocusto interno das bibliotecas. Estes sistemas, em sua maioria necessitamarmazenar os dados em algum padrão de metadados para lidar cominformações flexíveis e dinâmicas como o MARC. Tradicionalmente sãousados bancos de dados relacionais, que em sua maioria apresentamestruturas rígidas para o armazenamento de dados. O propósito deste estudofoi comparar a performance dos SGDB PostgreSQL e MongoDB para oarmazenamento e busca de metadados MARC."
    },
    {
        "abstract": "This article performs an analysis of texts extracted from the socialnetwork, Twitter, in relation to the telecommunication services topics offeredby four companies, applying the sentiment analyses to detect complaints anddissatisfaction of users of a particular service. The study also makes a relationbetween signal quality complains extracted on social network with the numberof base stations of the user's social network region, which is extracted by amobile service application. The main topics of the complaints are detected anda monitoring system points out the main problems to the telecommunicationcompanies and national regulatory agencies.",
        "resumo": "Este artigo faz a análise de textos extraídos da rede social, Twitter,em relação a tópicos de serviços de telecomunicação ofertados por quatroempresas, efetuando a análise de sentimentos para detecção de reclamaçõesou insatisfação de usuários sobre um determinado serviço. O estudo tambémfaz uma relação entre qualidade de sinal e o número de estações bases daregião do usuário da rede social. Os principais objetos da reclamação sãodetectados e um sistema de monitoramento aponta os principais problemas àsempresas de telecomunicações e agências nacionais reguladoras."
    },
    {
        "abstract": "During the process of learning a child, difficulties can be manifestedin relation to reading, writing and pronouncing letters and words. To solve thisproblem, a Development Monitoring System is being developed whose purposeis to assist students and teachers in early childhood education through recom-mendations. Through an application, the system can obtain information fromeach student. This information can be viewed by the teacher through the Per-formance Monitoring System. As a result of the development of the system, itis expected to achieve a recommendation system for intervention in teachingchildren with learning difficulties.",
        "resumo": "Durante o processo de aprendizagem de uma criança, dificuldadespodem ser manifestadas em relação a leitura, escrita e pronuncia de letras epalavras. Para solucionar este problema está sendo desenvolvido um Sistemade Acompanhamento de Desenvolvimento cujo objetivo é auxiliar os alunose professores da educação infantil através de recomendações. Por meio deum aplicativo, o sistema poderá obter informações de cada aluno. Essasinformações poderão ser visualizadas pelo professor através do Sistema deAcompanhamento de Desempenho. Como resultado do desenvolvimento do sis-tema espera-se alcançar um sistema de recomendação para intervenção no en-sino de crianças com dificuldades no aprendizado do alfabeto."
    },
    {
        "abstract": "As cities are becoming green and smart, transportation systems arebeing revamped to adopt digital technologies. Open transportation data mightinclude GIS maps for bus routes and bus stops. Such data provide a numberof opportunities to analyze a segment of the current state of the transportationsystem of a city. In this paper, we address and discuss some of the urban mo-bility open data available and their characterization from the perspectives oftwo metropolitan cities: Curitiba (Brazil) and New York City (USA). Finally, wepresent challenges regarding their use."
    },
    {
        "resumo": "A primeira matrícula de uma criança em fase escolar é uma atividademuito importante na vida dos pais e das crianças. A definição da escola é algofundamental. Principalmente em grandes cidades, há várias escolas municipais deeducação infantil, distribuídas geograficamente pela cidade, algumas maispróximas outras mais distantes da residência dos alunos. O SIRME é um Sistemade Recomendações que utiliza um Sistema de Informações Geográficas (SIG), paradefinir a melhor escola para o aluno se matricular, levando em consideração adistância e outras regras definidas pelo município ou de acordo com anecessidade dos pais."
    },
    {
        "abstract": "This paper describes the development progress of the EasyTest plat-form, developed from the test process proposed by DAL FORNO (2016). Theplatform will allow outsourcing of the functional tests execution, allowing col-laboration of external testers to the organization. The use of recommendationbased on profile and reputation will enable professionals evaluate the compati-bility between testers profiles and test tasks, assisting in the decision making fortesters recruitment in the platform.",
        "resumo": "Este artigo descreve o andamento do desenvolvimento da plataformaEasyTest, desenvolvida a partir do processo de teste proposto por DAL FORNO(2016). A plataforma permitirá a terceirização da execução de testes funci-onais, possibilitando a colaboração de testadores externos à organização. Ouso de recomendação baseada em perfil e reputação permitirá aos profissionaisavaliar a compatibilidade entre perfis de testadores e de tarefas de teste, auxili-ando na tomada de decisão para o recrutamento de testadores na plataforma."
    },
    {
        "abstract": "The urban transport system has increasingly provided a variety ofdata (sensors, bus routes, passengers, etc.). These data provide opportunitiesto identify traffic problems and assist the system planning and management.In this paper we address challenges and opportunities of urban dataintegration in a Geographic Information System (GIS) to the planning andmanagement of speed limit enforcement devices in public transport inCuritiba ­ Brazil.",
        "resumo": "O sistema de transporte urbano tem crescentemente fornecido umavariedade de dados (sensores, rotas de ônibus, passageiros, etc). Esses dadosfornecem oportunidades para identificar problemas de tráfego e auxiliam noplanejamento e gerenciamento do sistema. Neste artigo abordamos desafios eoportunidades encontrados na integração de dados urbanos em um Sistemade Informação Geográfica (SIG) para o planejamento e gestão de redutoresde velocidade no transporte público em Curitiba ­ Brasil."
    },
    {
        "abstract": "This paper presents an online tool for running SQL scripts,integrated with the URI Online Judge website. The URI SQL is a tool in finalphase of development, which will assist students and teachers in the databasedisciplines, presenting a visual environment for submitting and testing scriptsin query language.",
        "resumo": "Este artigo apresenta uma ferramenta online de execução de scriptsSQL, integrada com a ferramenta URI Online Judge. O URI SQL é umaferramenta em fase final de desenvolvimento que apoiará alunos e professoresnas disciplinas de Banco de Dados, apresentando um ambiente visual parasubmissão e testes de execução de scripts em linguagem de consulta."
    }
]