[
    {
        "abstract": "The growth of population density of urban regions requires anadequate provision of basic health services and infrastructure. This increaseof the population demonstrates challenges to cities, mostly in the question ofpublic health. ​This paper presents an analysis of the open data of Paraguaythat is related to healthcare, from its availability, their establishments,professionals and products, to a general and dynamic analysis of theinformation contained in this open data, finishing with a comparison with thecity of Curitib​a​.",
        "resumo": "O aumento da densidade demográfica no ambiente urbano requeruma provisão adequada de serviços básicos de saúde e infraestrutura. Essecrescimento da população apresenta desafios às ​cidades, principalmente noquesito dos serviços de saúde pública. Este artigo traz uma análise dos dadosabertos do Paraguai que são relacionados a saúde, desde suadisponibilização, estabelecimentos, profissionais e produtos, até uma análisegeral e dinâmica das informações contidas nos dados abertos, finalizandocom uma comparação com a cidade de Curitiba."
    },
    {
        "abstract": "In the context of smart cities, the information of businesses licenseshas the potential to discriminate economics characteristics of the observed ur-ban environment. This work performs an quantitative and entropic analysis ofbusinesses licenses in an area around establishments considered as key venues(i.e., businesses that highly influence a neighborhood). Given the analysis ispossible to notice that after the inauguration of each of the 2 studied shoppings,the number of licenses reaches a peak followed by a dramatic drop. From en-tropy variation is observable that in both shoppings there are a bigger disper-sion compared to the rest of the neightborhood.",
        "resumo": "No contexto de cidades inteligentes, a informação de alvarás tempotencial de discriminar as caracterı́sticas econômicas do meio urbano ob-servado. Neste trabalho é feita uma análise quantitativa e entrópica sobre aemissão de alvarás próximos a estabelecimentos considerados chave (isto é,estabelecimentos que afetam fortemente sua vizinhança). Dada a análise épossı́vel notar que após a inauguração de cada um dos 2 shoppings centersestudados o número de alvarás abertos alcança um pico seguido por uma quedavertiginosa. A partir da variação da entropia também é notável que há em am-bos os shoppings uma maior dispersão nos tipos de alvarás que o restante dobairro."
    },
    {
        "abstract": "Graph databases are a type of NoSQL databases focused on highlyconnected data and dynamic relationships, characteristics that make them plau-sible for applications such as social networks and preferences systems. Withdata becoming increasingly sparse and semi-structured, it’s questioned whethergraph databases already have maturity to be more advantageous than relationaldatabases to access complex data using queries with a declarative syntax. Thepurpose of this work is to compare two database leaders in graph and relationaltechnnology (Neo4J and MySQL, respectively) with respect to their performancein accessing complex data, using only the resources of their declarative querylanguages.",
        "resumo": "Os bancos de dados de grafo são um tipo de bancos de dados NoSQLvoltados a dados altamente conectados e com relacionamentos dinâmicos, ca-racterísticas plausíveis para aplicações como redes sociais e sistemas de prefe-rências. Com os dados se tornando cada vez mais esparsos e semi-estruturados,questiona-se se bancos de dados de grafo já possuem maturidade para seremmais vantajosos do que bancos de dados relacionais para acessar dados com-plexos usando consultas com uma sintaxe declarativa. O objetivo deste trabalhoé comparar dois bancos de dados líderes nas tecnologias de grafo e relacional(Neo4J e MySQL, respectivamente) em relação ao seu desempenho no acesso adados complexos, usando apenas recursos de suas linguagens declarativas."
    },
    {
        "resumo": "A Web Semântica tem como princı́pio a organização e publicaçãodas informações com conteúdo semântico. Ela adota o modelo RDF comopadrão de armazenamento e a linguagem SPARQL para consultas. A grandequantidade de dados de RDF existente requer que as consultas SPARQL se-jam processadas de forma eficiente. Os trabalhos de [de Lima Prado 2018] e[G. Pauluk and Hara 2016] buscaram uma solução para este problema atravésdo armazenamento de dados RDF em um Sistema Gerenciador de Banco deDados Relacional (SGBDR) e da tradução de consultas SPARQL para SQL.Este artigo apresenta uma investigação que deu continuidade a esses traba-lhos, com o objetivo de otimizar o mapeamento de consultas SPARQL paraSQL, utilizando ı́ndices, visões e filtros. Os experimentos realizados determi-naram o impacto desses recursos no desempenho das consultas. Constatou-seque a implementação de visões é altamente recomendável, com uma reduçãodo tempo de processamento da consulta de até 54,4%. A utilização de filtrosque desconsideram tuplas contendo valores nulos resultou em uma redução dotempo de processamento da consulta de até 58,8%."
    },
    {
        "abstract": "In the context of information retrieval, similarity search for rangequeries is the problem of finding words whose edit distance to a query are smal-ler than a determined distance. BK-trees is a pivot based indexing mechanismthat achieves good results for this kind of query. Experiments show that, despiteits simplicity, the efficiency is superior to other approaches when it comes totext searching. However, no information is provided concerning the underlyingstructure of the tree. In this paper, we analyze different ways of implementingthis indexing structure. Our experiments compare the investigated variations interms of space cost, indexing time and search time.",
        "resumo": "No contexto de recuperação de informação, o problema de busca porsimilaridade para consultas por intervalo é caracterizado pela busca de pa-lavras cuja distância de edição até a consulta seja menor do que um limiteestipulado. BK-tree é um método de indexação que traz bons resultados paraesse tipo de consulta. Experimentos mostram que, apesar da sua simplicidade,na busca textual sua eficiência é superior à outras abordagens. No entanto, ne-nhuma informação foi dada a respeito da estrutura da árvore. Neste artigo sãoanalisadas formas diferentes de implementação desta estrutura de indexação.Os experimentos elaborados comparam as variações investigadas em termos decusto em espaço, tempo de indexação e tempo de busca."
    },
    {
        "abstract": "This paper explores the prediction of total demand of nursing serviceon public hospitals and walkin clinics of the city of Curitiba. The analysis isbased on data mining techniques applied to open data provided by themunicipality and weather data by Weather Underground. We present here anexploratory analysis and the implementation of a preliminary model of linearregression to estimate the variation of the demand for healthcare service relatedto respiratory ailments.",
        "resumo": "Este trabalho explora a predição de volume de atendimentos dedoenças respiratórias na rede pública da cidade de Curitiba. A análise ébaseada em métodos de mineração de dados aplicados em dados abertos deatendimento fornecidos pelo município e dados climáticos fornecidos peloportal Weather Underground. Apresentamos aqui uma análise exploratória dosdados e a implementação de um modelo preliminar de regressão linear paraestimativa de variação no volume de atendimentos referentes a doençasrespiratórias."
    },
    {
        "abstract": "This paper describes a method for obtaining decision trees forpredicting carcasse zootechnical quality indicators for bovine based on theirbreeding data. For such, data mining classification tasks were performed afterdata preprocessing. All numeric attributes were discretized by non-equalfrequency binning or by cluster discovery in distinct classificationexperiments. Obtained results showed that clustering techniques as means fordiscretization may generate classes in better balancing conjecture when incomparison to the non-equal frequency binning method, allowing thediscovery of models that may be applied to real world problems.",
        "resumo": "Este artigo descreve uma metodologia para obtenção de árvores dedecisão para previsão de indicadores zootécnicos de qualidade de carcaçasbovinas com base em variáveis de cria dos animais. Para tal, procedeu-se atarefas de mineração de dados com classificação após pré-processamentocom discretização dos atributos numéricos por particionamento igualitário dointervalo ou por descoberta de agrupamentos em experimentos distintos declassificação. Os resultados obtidos mostraram que a descoberta deagrupamentos como forma de discretização pode gerar classes combalanceamento de melhor qualidade em comparação ao método tradicional,permitindo a indução de modelos utilizáveis em problemas reais."
    },
    {
        "abstract": "— It is estimated that, in Brazil, approximately 15% of electricity isconsumed fraudulently, a practice known as non-technical loss. This article isan applied study that analyzes the identification of these losses in thedistribution networks in order to recognize distortions in relation to therespective consumption patterns of each consumer and, from the analysis ofthis information, to detect possible deviations that can be classified as frauds.For this purpose, data mining and machine learning techniques were appliedto commercial consumers in the State of Santa Catarina, presenting evidencethat these techniques can be used to identify patterns of irregular electricityconsumption.",
        "resumo": "É estimado que, no Brasil, aproximadamente 15% da energiaelétrica é consumida de forma fraudulenta, prática essa denominada perdanão-técnica. Este artigo é um estudo aplicado que analisa a identificaçãodessas perdas nas redes de distribuição para reconhecer distorções emrelação aos respectivos padrões de consumo de cada consumidor e, a partirda análise desta informação, detectar possíveis desvios que possam serclassificados como fraudes. Para tal, foram aplicadas técnicas de mineração edados e aprendizado de máquina nos consumidores comerciais do Estado deSanta Catarina, apresentando evidências de que essas técnicas podem serusadas para identificar padrões de consumo de energia elétrica irregulares."
    },
    {
        "abstract": "Twitter is a powerful platform for opinions diffusion. Knowing this,companies and influential personalities use the platform as a way to connectwith their audience, with the goal of boosting their popularity. On Twitter, thetools which are able to measure popularity are the retweets and likes that eachpost receives. In this paper, the purpose is to analyze the content of the messagestransmitted through the platform and correlate them with their popularity. Cha-racteristics of the messages such as the feeling, its size in characters, banalityand the use of URLs or hashtags are evaluated. It was possible to identify, in ageneral way, a preference for tweets with a good feeling and median banality,while the message’s size had a different influence on retweets and likes.",
        "resumo": "O Twitter é uma plataforma poderosa para a difusão de opiniões. Sa-bendo disso, empresas e personalidades influentes usam a plataforma como ummeio de se conectar com seu público com o objetivo de alavancar a popula-ridade. No Twitter, os mecanismos capazes de medir a popularidade são osretuı́tes e curtidas que cada publicação recebe. Neste trabalho, o objetivo éanalisar o conteúdo das mensagens veiculadas através da plataforma e corre-lacioná-las com sua popularidade. Foram avaliadas caracterı́sticas da mensa-gem como o sentimento, tamanho em caracteres, banalidade e o uso de URLs ouhashtags. Foi possı́vel identificar, de maneira geral, uma preferência do públicopor tuı́tes com sentimento positivo e banalidade mediana, enquanto o tamanhodas mensagens influenciou de maneira diferente nos retuı́tes e curtidas."
    },
    {
        "abstract": "Optical character recognition software is designed to convert textualelements of documents into editable and searchable text. This task presentsspecific challenges when submitted to images captured by smartphonecameras. ​This work experimentally analyzes the relationship betweenextraction efficiency in images captured by smartphones and theircharacteristics. The experiments demonstrate that images with curvilinear textand light variation do not substantially compromise extraction efficiency,whereas images with inclined texts as well as images with unclear charactershave the lowest extraction rates.",
        "resumo": "Softwares de reconhecimento óptico de caracteres têm comopropósito converter elementos textuais de documentos em texto editável epesquisável. Essa tarefa apresenta desafios específicos quando submetida aimagens capturadas por câmeras de smartphones. Este trabalho analisaexperimentalmente a relação entre a eficácia de extração em imagenscapturadas por smartphones e suas características. Os experimentosdemonstram que imagens com texto curvilíneo e variação de iluminação nãocomprometem substancialmente a eficácia de extração, ao instante queimagens com textos inclinados, bem como imagens que possuem caracterespouco nítidos, apresentam os menores índices de extração."
    },
    {
        "abstract": "Problems related to Urban Mobility on large urban centers causecountless damages not only to the citizen but also to the environment. To dealwith this problem, the Speed Controller Device (SCD) is a fundamental resourceused by Public Administration in urban and road planning. This paper presentsan analisys of official georreferenced data from roads and speed control devicesof Curitiba, aiming to verify if the SCD are installed in accordance to currentlegislation.",
        "resumo": "Problemas relativos a Mobilidade Urbana nos grandes centros aca-bam por causarem inúmeros prejuı́zos não só ao cidadão como também ao meioambiente. Para equalizar este problema, os Dispositivos Redutores de Veloci-dade (DRV) são recursos fundamentais, utilizados pela administração públicano planejamento urbano e viário. Este artigo apresenta uma análise de da-dos georreferenciados das vias públicas e dos dispositivos redutores de veloci-dade de Curitiba, com o intuito de verificar se os DRV estão de acordo com aslegislações vigentes."
    },
    {
        "abstract": "This paper describes the development of a Web solution that allowsthe dynamic visualization of academic collaboration networks. The applica-tion uses data from the Lattes platform to identify and display the relationshipbetween sets of researchers.",
        "resumo": "Este artigo descreve o desenvolvimento de uma solução Web que per-mite a visualização dinâmica de redes de colaboração acadêmica. A aplicaçãoutiliza dados da plataforma Lattes para identificar e exibir a relação entre con-juntos de pesquisadores."
    },
    {
        "abstract": "One of the challenges in the Internet of Things – IoT is how topublish and share the data related to devices. One almost unexploredpossibility is to use Semantic Web resources. Thus, this work aims to explorethe use of some of Semantic Web resources to publish and share data relatedto a smart socket.",
        "resumo": "Um dos desafios na Internet das Coisas está em como publicar ecompartilhar dados relacionados aos dispositivos. Uma possibilidade, aindapouco explorada, é fazer uso de recursos da Web Semântica. Assim, estetrabalho tem por objetivo explorar o uso de recursos da Web Semântica parapublicar e compartilhar dados relacionados a uma tomada inteligente."
    },
    {
        "abstract": "This paper presents DINo, a tool to help import relational data toNoSQL databases. Its main characteristics are: be multiplatform; support vari-ous types of DBMS (both relational and NoSQL); be flexible, allowing the userto make changes to the data mapping, publicly available. Tests were performedwith data from an OpenStreetMap database.",
        "resumo": "Este artigo apresenta o DINo, uma ferramenta para importaçãode dados relacionais para bancos de dados NoSQL. Suas principais carac-terı́sticas são: multiplataforma; suportar diversos tipos de SGBDs (relacionaise NoSQL); permitir alteração no mapeamento dos dados; e, estar disponı́vel pu-blicamente. São apresentados testes realizados com dados do OpenStreetMap."
    }
]