[
    {
        "abstract": "This work specifies an HL7-based middleware capable of encoding,storing and interoperating Electronic Health Record data. Based on the HL7clinical document architecture, the software architecture of the proposedmiddleware was specified, a set of rules were described to map the informationof a relational data schema in HL7 messages and a tool was implemented tosupport the data interoperability through the proposed solution.",
        "resumo": "Este trabalho especifica um middleware em nuvem baseado no padrãoHL7 capaz de codificar, armazenar e interoperar os dados do RegistroEletrônico em Saúde (RES) entre organizações do setor de saúde. Baseado naarquitetura de documentos clínico do HL7, especificou-se a arquitetura desoftware do middleware proposto, descreveu-se um conjunto de regras quemapeiam as informações de um esquema de dados relacional em mensagensHL7 e implementou-se uma ferramenta que dá suporte a interoperabilidade doRES por meio da solução proposta."
    },
    {
        "abstract": "Data distribution is indispensable to keep applications available andaccessible when dealing with a high volume of requests. To meet this demand,PostgreSQL provides a wide variety of tools for data replication. However, un-derstanding its characteristics and limitations is complex and time consuming.In this paper, we present an exploratory study about the features and limitationsof the main open source tools for data replication in PostgreSQL, to reduce thecomplexity and time spent by database administrators in choosing the tool thatmeets their replication requirements.",
        "resumo": "A distribuição de dados é indispensável para manter aplicações dis-ponı́veis e acessı́veis ao lidar com um grade volume de requisições. Para aten-der essa demanda, o PostgreSQL fornece uma vasta variedade de ferramentaspara replicação de dados. Entretanto, entender suas caracterı́sticas e limitaçõesé algo complexo e demanda tempo. Neste artigo, apresenta-se um estudo ex-ploratório sobre os recursos e limitações das principais ferramentas de códigoaberto para a replicação de dados no PostgreSQL, buscando reduzir a comple-xidade e o tempo gasto por administradores de bases de dados na escolha daferramenta que melhor preencha seus requisitos de replicação."
    },
    {
        "abstract": "Several applications have as requirements the need to handle largeand heterogeneous data volumes as well as the support to handle thousands ofOLTP transactions per second. Traditional relational databases (DBRs) are notsuitable for these requirements. On the other hand, NoSQL DBs are able to dealwith Big Data, but lacks the support to ACID properties. NewSQL is a new classof DBs that combines the support to OLTP transactions of BDRs with the highavailability and scalability of NoSQL DBs. However, few works in the literatureexplore the differences among different NewSQL solutions. In this paper, weexecute benchmark software to compare the most prominent NewSQL productsanalyzing the results. This analysis can be useful as a guide to future use ofNewSQL technology.",
        "resumo": "Diversas aplicações produzem e manipulam grandes volumes hete-rogêneos de dados, bem como necessitam lidar com um grande número detransações OLTP. Os tradicionais Bancos de Dados Relacionais (BDRs) nãosão adequados a este tipo de demanda. Já os BDs NoSQL, apesar do me-lhor gerenciamento de Big Data, não garantem as propriedades ACID. O movi-mento NewSQL visa suportar transações OLTP dos BDRs com uma arquiteturadistribuı́da que oferece alta escalabilidade e disponibilidade, tı́pica dos BDsNoSQL. Poucos trabalhos na literatura exploram as diferenças entre soluçõesNewSQL. Assim, este trabalho visa comparar alguns dos principais produtosNewSQL utilizando benchmarks de domı́nio. Esta análise contribui como umguia de referência para futuros usos da tecnologia NewSQL."
    },
    {
        "abstract": "In recent years there have been several proposals aimed at centra-lizing and manipulating health data, such as the electronic medical records.Because this type of data are highly sensitive, issues as how to ensure data con-fidentiality have always been a chalenge. The emergence of technologies suchas blockchains and smart contracts has brought new approaches to the manipu-lation of these data. This paper proposes the use of blockchain in conjunctionwith smart contracts for centralization and sharing of health data. Preliminaryexperiments demonstrated the feasibility of securely storing and retrieving datathrough the use of two pairs of asymmetric keys",
        "resumo": "Nos últimos anos houveram diversas propostas visando acentralização e manipulação de dados de saúde, como prontuário eletrônicodo cidadão. Por se tratarem de dados altamente sigiloso, problemas de comogarantir a confidencialidade dos dados sempre foram um entrave. O surgi-mento de tecnologias como blockchains e smart contracts vem trazendo novasabordagens possı́veis na manipulação desses dados. Este trabalho apresentauma proposta de utilização de blockchain em conjunto com smart contractspara centralização e compartilhamento de dados de saúde. Experimentospreliminares demonstraram a viabilidade do armazenamento e recuperaçãodos dados de forma segura, através da utilização de dois pares de chavesassimétricas."
    },
    {
        "abstract": "​Social networks are increasingly impacting everyday people andorganizations, in this context Twitter, in which a user writes an expressionwith up to 280 characters and other people can see or share that phrase againor their own. This paper presents a work that aims to consume the great datarepository that is Twitter, and from it to create a Data Warehouse in which itis possible to analyze the texts, the expressions contained. In this proposal,methods of preprocessing texts are included. Also to enrich this base with theanalysis of feeling, in addition to the project of the database the proposalincludes a classifier method for the texts, using machine learning, that is ableto predict a feeling related to a Tweet, be it positiva, neutral or negative.",
        "resumo": "As redes sociais cada dia mais causam impacto no cotidiano das pessoase organizações, neste contexto, o Twitter, no qual um usuário escreve umaexpressão com até 280 caracteres e outras pessoas podem ver ou compartilharnovamente essa mesma expressão ou a sua própria. Este artigo apresenta umtrabalho que tem como objetivo consumir o grande repositório de dados que éo Twitter, e, a partir dele criar um Data Warehouse no qual é possívelanalisar os textos, as expressões contidas. Nesta proposta, são incluídosmétodos de pré-processamento dos textos. Também para enriquecer essa basecom a análise de sentimento, além do projeto do banco de dados a propostainclui um método classificador para os textos, utilizando aprendizado demáquina, que é capaz de predizer um sentimento relacionado a um Tweet, sejaele positivo, neutro ou negativo."
    },
    {
        "abstract": "Short texts are very popular in social media. Comments and reviewsare examples of common short texts found in the Web. Topics extraction fromtext is a challenging task for content analysis. Lately, probabilistic topic model-ling has been used as a tool for topic extraction. To extract topics from shortdocuments is more challenging since the word co-occurrence is more sparse.The aim of this work is, thus, evaluate some short documents topic modelling toidentify which one is more suitable in the scenarios proposed. We conduct ex-periments on three short text collections, and results show that the approacheshave similar performances.",
        "resumo": "Devido ao amplo uso das redes sociais, textos pequenos se popula-rizaram na Web. Extrair tópicos de uma grande quantidade de textos curtostornou-se uma tarefa crı́tica e desafiadora em tarefas de análise de conteúdo.Neste contexto, várias abordagens foram propostas para inferir tópicos a partirde conjuntos de coleções de textos curtos. Este trabalho tem como objetivo ava-liar o uso de algumas destas abordagens probabilı́sticas na extração de tópicosem documentos curtos utilizando métricas para este fim. Os experimentos rea-lizados em três coleções mostram que as abordagens estudadas tem resultadossimilares nos cenários propostos."
    },
    {
        "abstract": "Social media is increasingly present in people’s lives, including toolsthat allow users to collaborate with the creation of the content. Many users uti-lize these functions to post texts spreading illicit or criminal content. Most workson abusive identification use supervising learning, which demands the featureextraction to achieve good quality. The meta-feature represents a state-of-the-art feature extraction on text classification. In this work, we propose a combi-nation of feature extraction to improve the detecting of offensive speech usingmeta-features. Our results, on real datasets, show that our proposed combina-tion of features outperforms in around 3.5% the effectiveness of state-of-the-artapproaches.",
        "resumo": "As mı́dias sociais estão cada vez mais presentes na vida das pessoas,incluindo ferramentas que permitam que o usuário colabore com a criação doconteúdo nelas exposto. Muitos usuários se aproveitam dessa funcionalidadepara disseminar conteúdo ilı́cito ou criminoso. Caso não seja removido, esteconteúdo será visto por cada vez mais pessoas e poderá ser propagado pelainternet, atingindo um número maior de vı́timas e incentivando a ocorrência deoutros crimes. Este artigo propõe explorar e extrair caracterı́sticas de textosutilizando técnicas de processamento de linguagem natural e aprendizado demáquina para detectar automaticamente discursos de ódio. Os experimentosdemonstraram que o método foi capaz de melhorar a qualidade em até 3,5% emrelação ao método base."
    },
    {
        "resumo": "Analisar dados públicos com o intuito de gerar informações rele-vantes à sociedade é um tema que vem sendo discutido nos últimos anos, prin-cipalmente devido à facilidade de acesso a muitos desses dados que estãodisponibilizados de forma aberta na Web. Tendo isso em vista, o objetivodesse trabalho é explorar os números de acidentes de trânsito e suas carac-terı́sticas, como localização, mortalidade, tipo de via, entre outros, com o in-tuito de prover análises que possam auxiliar na compreensão e caracterizaçãodessas ocorrências, utilizando-se do auxı́lio de tecnologias para manipulaçãode informações geoespaciais."
    },
    {
        "abstract": "This paper describes the REx (Redis Schema Extraction) module,which allows schema generation for NoSQL key-value databases, and it is cou-pled to the JSON Schema Discovery tool. REx implements the first step (Ge-neration of Raw Schemas) of the schema extraction process developed in JSONSchema Discovery. The extraction strategy accomplished by REx is the maincontribution of this paper.",
        "resumo": "Este artigo descreve o módulo REx (Redis Schema Extraction), quepermite a geração de esquemas para bancos de dados NoSQL chave-valor,sendo um componente da ferramenta JSON Schema Discovery. REx implementaa primeira etapa (Geração de Esquemas Brutos) do processo de extração de es-quemas realizado pela JSON Schema Discovery. A estratégia de extração ado-tada pelo REx é inovadora na área de extração de esquemas de dados NoSQL."
    },
    {
        "resumo": "A compreensão do efeito dos diversos fatores que influenciam o de-sempenho acadêmico é um requisito importante para a melhoria de práticaseducacionais. Como humanos são seres altamente sociáveis, fatores sociaispodem ter um papel importante no contexto acadêmico. Este artigo analisa oimpacto sobre o desempenho acadêmico de variáveis sociais como o cı́rculo deamigos de um aluno e variáveis de dinâmica de grupo como tendências de agru-pamentos. A análise é baseada em dados de 6 turmas da disciplina Bancos deDados. Este artigo apresenta resultados iniciais que demonstram correlaçõesestatisticamente relevantes entre fatores sociais e desempenho acadêmico."
    },
    {
        "abstract": "This paper presents the process of consolidating the databases of theBrazilian Institute of Geography and Statistics (IBGE), OpenStreetMaps(OSM) and the Municipality of Blumenau (PMB), with the purpose of makinga diagnosis about the socioeconomic and developmental aspects ofneighborhoods Victor Konder and Itoupava Seca of the city of Blumenau,being able to be adapted for the diagnosis of other regions. Such informationis relevant to the understanding of the district and also considerable for theplanning of policies and actions that may occur in the region considering fiveaxes: city, people, environment, economy and mobility.",
        "resumo": "Este artigo apresenta o processo de consolidação das bases dedados do Instituto Brasileiro de Geografia e Estatística (IBGE),OpenStreetMaps (OSM) e da Prefeitura Municipal de Blumenau (PMB), tendocomo intuito fazer o diagnóstico quanto aos aspectos socioeconômicos e dedesenvolvimento dos bairros Victor Konder e Itoupava Seca da cidade deBlumenau, podendo ser adaptado para o diagnóstico de outras regiões. Taisinformações se mostram pertinentes para a compreensão do distrito e tambémconsideráveis para o planejamento de políticas e ações que venham a ocorrerna região considerando cinco eixos: cidade, pessoas, ambiente, economia emobilidade."
    },
    {
        "resumo": "Este artigo apresenta resultados preliminares em detecção au-tomática de metáforas e análise do seu uso em textos do domı́nio jornalı́stico.Para a anotação das metáforas nas notı́cias, empregamos um modelo derede neural recorrente bidirecional LSTM. O objetivo principal é analisar aexistência de diferenças nas caracterı́sticas de notı́cias falsas em relação ànotı́cias confiáveis no uso de linguagem metafórica. Neste artigo apresenta-mos resultados iniciais da anotação e análise com foco nos tı́tulos das notı́ciasde um corpus de artigos em inglês."
    },
    {
        "abstract": "This paper presents the proposal of a data warehouse architecturethat has as data source and object of study the IP flows and attacks in SDN.The proposal aims to provide a consistent and clean dataset for machinelearning applications and any application that wishes to consume data of thisfeature. For the proposed objectives, a multidimensional database wasdeveloped, which is fed by an ETL stage based on the collection of networkflows. Among the obtained results is the architecture itself, in which a datasetcan be explored through OLAP queries by machine learning applications.",
        "resumo": "Este artigo apresenta a proposta de uma arquitetura de datawarehouse que tem como fonte de dados e objeto de estudo os fluxos IP eataques em SDN. A proposta tem como objetivo fornecer um conjunto dedados consistente e limpo para aplicações de aprendizado de máquina equalquer aplicação que deseje consumir dados desta característica. Paraatingir os objetivos propostos, foi desenvolvido um banco de dadosmultidimensional, que é alimentado por uma etapa de ETL baseada na coletade fluxos de rede. Dentre resultados obtidos é a arquitetura em si, na qual umconjunto de dados pode ser explorado através de consultas OLAP pelasaplicações de aprendizado de máquina."
    },
    {
        "resumo": "Com o rápido avanço da tecnologia e o fácil acesso e disseminaçãode informações, o termo fakenews vem ganhando preocupante atenção epesquisas em diversas áreas vêm sendo desenvolvidas. Sendo assim, o objetivodeste trabalho é usar métodos de aprendizado de máquina para descobrir,classificar e armazenar textos de notícias falsas, para posterior aplicação aetapa ETL de um Data Warehouse e um ambiente de consulta que contribuirácom pesquisas futuras. Para isso foi criado um dataset e os métodosRegressão Logística, Naive Bayes e SVM foram avaliados. Finalizando otrabalho com a seleção do melhor método que foi inserido em um sistema deavaliação online de notícias falsas."
    },
    {
        "abstract": "The objective of this work is to analyze if there is a relationshipbetween the students' income and the number of police occurrences in theneighborhood in which they are based on the semantic integration ofheterogeneous open databases of education and security domains. To performthe integration an ontology is proposed with the intention of semantically unifythe base domain and formally specify the data relationship.",
        "resumo": "O objetivo desse trabalho é analisar se existe uma relação entre orendimento de alunos com a quantidade de ocorrências policiais do bairro emque se encontram a partir da integração semântica de bases de dados abertasheterogêneas dos domínios de educação e segurança. Os dados utilizados sãoreferentes à cidade de Curitiba-Paraná. Para realizar a integração umaontologia é proposta com o intuito de unificar semanticamente o domínio dasbases e especificar formalmente o relacionamento dos dados."
    },
    {
        "abstract": "Information Systems may be configured as tools to support the studyand decision making related to environmental issues. Together with databasesin a datawarehouse format, these decisions may be geared towards thehistorical scope of the data. The Environmental Information System - SIA, wasdeveloped to store and allow queries of environmental historical data from theTaquari-Antas Hydrographic Basin, in which are installed severalhidroeletric plants. This paper presents the development of data visualizationcapabilities for the Water Quality Index at multiple points in the region.",
        "resumo": "Sistemas de Informação podem se configurar como ferramentaspara apoio ao estudo e à tomada de decisões relacionadas às questõesambientais. Em conjunto com bancos de dados em formato datawarehouse,estas decisões podem estar voltadas ao âmbito histórico dos dados. O Sistemade Informação Ambiental - SIA, foi desenvolvido para armazenar e permitir aconsulta de dados históricos ambientais de diversas centrais hidrelétricasinstaladas na Bacia Hidrográfica Taquari-Antas. Esse trabalho apresenta odesenvolvimento de recursos de visualização de dados para o Índice deQualidade da Água em múltiplos pontos da região."
    }
]